[
  {
    "name": "Empee Fabrics",
    "id": "1",
    "address": "31 Commercial Rd, London N18 1TP",
    "category": "Fabric Shop",
    "phone": "020 7790 2233",
    "website": "http://www.wholesalefabrics.co.uk/",
    "opening_hours": "Monday\n9:30 am–5 pm\nTuesday\n9:30 am–5 pm\nWednesday\n9:30 am–5 pm\nThursday\n9:30 am–5 pm\nFriday\n9:30 am–12 pm, 3pm–5 pm\nSaturday & Sunday\nClosed",
    "pop_up": "Empee is a London fabric supplier with a large range of materials, including cottons, silks, wools, linens and upholstery fabrics. People often use it for its broad selection and trade-friendly prices. The space has a straightforward, warehouse-style feel rather than a boutique atmosphere.",
    "lat": 51.60886,
    "lng": -0.07417,
    "tags": [
      "Cotton",
      "Silk",
      "Wool",
      "Linen",
      "Denim",
      "Upholstery",
      "Wholesale",
      "Large-stock",
      "Value",
      "Production-friendly"
    ],
    "more_info": "Empee began as a wholesale textile supplier and still operates mainly in that mode, holding a very large volume of stock at its London warehouse. The range covers everyday fabrics like cotton, jersey and denim, alongside silks, suiting, upholstery and production-ready materials. Reviews often mention that pricing is reasonable for bulk or trade use, and that the experience is practical and no-frills. Customers who visit regularly tend to be students, small brands and makers who need reliable stock levels without boutique mark-ups, though some note that the scale of the warehouse means service can feel functional rather than personalised.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Woolcrest",
    "id": "2",
    "address": "6 Well St, London E9 7PX, UK",
    "category": "Fabric Shop",
    "phone": "07966 540986",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\t10 am–5 pm\nSunday\t10:30 am–4:30 pm",
    "pop_up": "Woolcrest is a long-running East London shop with a huge range of dress and furnishing fabrics, from basics to heavier wools. People often come for the variety and good value, especially on cottons and prints. Reviews on service differ, but most agree the pricing is fair for the quality.",
    "lat": 51.53937,
    "lng": -0.05522,
    "tags": [
      "Cotton",
      "Wool",
      "Suiting",
      "Upholstery",
      "Cheap",
      "Wholesale",
      "Basics",
      "Variety",
      "Low-cost",
      "Bulk-buy"
    ],
    "more_info": "Woolcrest began in the early 1980s, founded by a refugee who started out selling leftover factory fabrics around the East End before gradually growing into a full wholesale-to-retail business. The Hackney shop now operates as a large, family-run warehouse with shelves stacked high in cottons, wools, upholstery cloth and seasonal fabrics. Customers often describe it as a 'go-to' spot for both range and affordability, especially for cottons and printed fabrics, and many regulars rely on the store because they can buy larger quantities without high mark-ups. Reviews mention the service as straightforward and sometimes brisk, but the selection and pricing usually outweigh that for people who prioritise choice and value over a boutique setting.",
    "average_price": "Basic cottons and prints typically range from £2.50–£5/m, mid-weight wool and suiting from £6–£10/m, and specialty or heavier fabrics around £12–£15/m. one",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Dalston Mill",
    "id": "3",
    "address": "69-73 Ridley Rd, London E8 2NP, UK",
    "category": "Fabric Shop",
    "phone": "020 7249 4129",
    "website": "http://www.dalstonmillfabrics.co.uk/",
    "opening_hours": "Monday\t9:30 am–5:30 pm\nTuesday\t9:30 am–5:30 pm\nWednesday\t9:30 am–5:30 pm\nThursday\t9:30 am–5:30 pm\nFriday\t9:30 am–6 pm\nSaturday\t9 am–6 pm\nSunday\t Closed",
    "pop_up": "Dalston Mill is a well-established fabric shop with a broad selection of materials including cottons, wools, silks, denims and upholstery fabrics. Many users highlight the quality of the fabric and the value offered. The environment is practical and merchandise-focused rather than boutique-luxur",
    "lat": 51.54823,
    "lng": -0.07165,
    "tags": [
      "Cotton",
      "Wool",
      "Silk",
      "Denim",
      "Upholstery",
      "Large-stock",
      "Value",
      "Production-friendly",
      "Bridal",
      "Wide-range"
    ],
    "more_info": "Dalston Mill has been operating for over 30 years and is recognised for offering a large in-store stock as well as an online service. Reviews frequently emphasise that fabrics arrive quickly and in good condition (\"high quality fabrics and very reasonable prices\" is a common comment). The store is appreciated by hobby-sewers, costume designers and makers needing reliable fabrics (many mention denim, drill, poplin). Some negative comments focus on delivery issues or missing items, so service is generally strong but not flawless.",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Whaleys Bradford",
    "id": "whaleys_bradford",
    "address": "Harris Ct, Great Horton Rd, Bradford BD7 4EQ",
    "category": "Fabric Shop",
    "phone": "01274 576718",
    "website": "http://www.whaleys-bradford.ltd.uk",
    "opening_hours": "Monday\t8:30 am–5 pm\nTuesday\t8:30 am–5 pm\nWednesday\t8:30 am–5 pm\nThursday\t8:30 am–5 pm\nFriday\t8:30 am–4 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "Whaleys Bradford is a specialist supplier of natural fabrics such as silks, cottons, linens, wools and loomstate materials like canvas and calico. It's often used by makers who need dye-ready or print-ready textiles. The business operates more like a warehouse supplier than a walk-in retail shop.",
    "lat": 53.78189,
    "lng": -1.78342,
    "tags": [
      "Natural-fibre",
      "Silk",
      "Cotton",
      "Linen",
      "Wool",
      "Loomstate",
      "Canvas",
      "Calico",
      "Dye-ready",
      "Production-stock"
    ],
    "more_info": "Founded in 1869, Whaleys Bradford has a long history in textile production and focuses on natural and untreated fabrics suited for dyeing, printing and manufacturing. Customers often mention that the shop carries materials that are harder to find elsewhere, especially loomstate fabrics, calicos, canvases and speciality silks. Feedback tends to highlight the usefulness of the stock for production and experimental work, while noting that the ordering system feels more trade-oriented and that delivery costs or minimums can be higher than typical hobby-sewing shops.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Classic Textiles",
    "id": "classic_textiles",
    "address": "44 Goldhawk Rd, London W12 8DH",
    "category": "Fabric Shop",
    "phone": "020 8743 3516",
    "website": "https://www.classictextiles.co.uk",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\t9 am–6 pm\nSunday\t Closed",
    "pop_up": "Classic Textiles supplies a wide range of fabrics including silks, cottons, linens, wools and tailoring materials. Many regulars visit for the selection and reasonable value, especially for dress- and suit-weight fabrics. The store maintains a practical, warehouse-style ambience rather than boutique luxury.",
    "lat": 51.50265,
    "lng": -0.22618,
    "tags": [
      "Silk",
      "Cotton",
      "Linen",
      "Wool",
      "Suiting",
      "Luxury-branded",
      "Tailoring",
      "Wide-range",
      "Value",
      "Multi-floor"
    ],
    "more_info": "Classic Textiles has been in business for over 50 years and over that time has carved a reputation for offering a broad textile range—from budget basics to premium suiting and designer-branded fabrics. Customers note that the shop is well stocked across multiple floors, with silks and Liberty-branded fabrics among the highlighted categories, especially in the downstairs and basement areas. While many appreciate the scale of the choice and the value compared to high-end luxury stores, some reviews say the layout and service reflect the high-volume nature of the business and may feel less personalised than boutique-focus shops.",
    "average_price": "Sale items at Classic Textiles have been listed from around £2.50/m for light silk chiffon or basic pieces, with some higher-end Italian silk satins reaching £27.50/m in sale sections. Standard printed cottons and mains fabrics typically sit in the mid-£7–£12/m range (based on public listings).",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Crescent Trading",
    "id": "crescent_trading",
    "address": "74 Norlington Rd, London E10 6LA",
    "category": "Fabric Shop",
    "phone": "07950 653602",
    "opening_hours": "Monday\t10 am–4 pm\nTuesday\t10 am–4 pm\nWednesday\t10 am–4 pm\nThursday\t10 am–4 pm\nFriday\t10 am–2 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "Crescent Trading is a warehouse-style fabric supplier known for British woollens, surplus rolls and off-run materials. Buyers often go there for volume stock and trade-level pieces rather than boutique fabrics. The atmosphere is practical and functional.",
    "lat": 51.56846,
    "lng": -0.00554,
    "tags": [
      "Wool",
      "Surplus",
      "Ends-of-roll",
      "Bulk-stock",
      "Trade-friendly",
      "Volume",
      "Warehouse",
      "Production-use",
      "British-fabric",
      "Value"
    ],
    "more_info": "Crescent Trading has its roots in the historic cloth-trade area and is often described as one of the last independent cloth merchants in its part of town. It specialises in woollens, surplus fabrics from mills and ends of rolls, which makes it popular with students, emerging designers and small manufacturers looking for interesting stock at accessible prices. The long-time owners have decades of experience and emphasise the tactile quality of their fabrics and the value offered in larger quantities. Some reviews note the service is no-frills and the space feels warehouse-like, but they emphasise that choice and trade-friendly pricing are the key draw.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Rainbow Fabrics",
    "id": "rainbow_fabrics",
    "address": "Unit 5, Kilburn market, Kilburn High Rd, London NW6 6PP",
    "category": "Fabric Shop",
    "phone": "020 7372 5050",
    "website": "http://www.rainbowfabrics.co.uk/",
    "opening_hours": "Monday\t9:30 am–5:30 pm\nTuesday\t9:30 am–5:30 pm\nWednesday\t9:30 am–5:30 pm\nThursday\t9:30 am–5:30 pm\nFriday\t9:30 am–5:30 pm\nSaturday\t9:30 am–5:30 pm\nSunday\t Closed",
    "pop_up": "Rainbow Fabrics offers a broad range of materials including cottons, denims, silks, jerseys and upholstery fabrics. Customers often highlight the value for money especially during sales. The shop has a practical, high-volume feel rather than boutique presentation.",
    "lat": 51.54113,
    "lng": -0.19703,
    "tags": [
      "Cotton",
      "Silk",
      "Denim",
      "Jersey",
      "Upholstery",
      "Value",
      "Wide-range",
      "Roll-stock",
      "Affordable",
      "High-volume"
    ],
    "more_info": "Rainbow Fabrics is known for its extensive fabric selection across many types — from everyday dress-weight cottons and jogging/jersey fabrics to richer silks and specialty denims. Reviewers frequently mention that prices are affordable (\"by far the most affordable fabric shop I use\") and that new stock arrives regularly, especially prints and wide-width fabrics. The space appeals to students, home-sewers and small brands who prioritise range and value, though a few users note that service and layout reflect the high-traffic, high-volume model rather than a quiet boutique experience.",
    "average_price": "Sale fabrics are often listed around £4–£6/m for dress-weight cottons or viscose blends and denim prints around £9.99/m for novelty items",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Z. Butt Textiles",
    "id": "z_butt_textiles",
    "address": "24 Brick Ln, London E1 6RF",
    "category": "Fabric Shop",
    "opening_hours": "Monday\t10 am–5 pm\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\t10 am–12 pm, 2–5 pm\nSaturday\t Closed\nSunday\t 10:30 am–2 pm",
    "pop_up": "Z Butt Textiles is a family-run fabric and haberdashery shop offering a wide mix of materials such as calicos, laces, embroidery supplies, foam, threads and more. Customers mention the large stock and value for money, especially for costume fabrics and hard-to-find trims. The atmosphere leans toward practical and trade-oriented rather than boutique.",
    "lat": 51.51802,
    "lng": -0.07095,
    "tags": [
      "Calico",
      "Lace",
      "Embroidery",
      "Foam",
      "Haberdashery",
      "Trims",
      "Fabric Mix",
      "Value",
      "Trade-friendly",
      "Costume-stock"
    ],
    "more_info": "Z Butt has been operating since the 1960s when it started as a small supplier of fabrics and haberdashery. Over the decades it has built a reputation for serving students, local makers, designers and light manufacturing needs, providing everything from basic textiles to more specialised materials. Reviewers highlight the packed-out shelves, friendly service and strong value — one noted a mix of sari fabrics, cheer-costume prints and standard supplies in one visit. Some users do mention that the layout and stock organisation feel like a warehouse environment, so it's best to allow time to browse.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "Saeeds Fabrics",
    "id": "saeeds_fabrics",
    "address": "94 High St, London E17 7JY, UK",
    "category": "Fabric Shop",
    "phone": "020 8509 1836",
    "website": "http://saeedsfabrics.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–3 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t9 am–6 pm\nSunday\t Closed",
    "pop_up": "Saeeds Fabrics offers a wide selection of fabrics including cottons, linens, silks, canvases, and upholstery materials. Many customers praise the quality and value, especially for dressmaking and soft furnishings. The shop presents a practical, no-frills environment rather than a boutique experience.",
    "lat": 51.58241,
    "lng": -0.02905,
    "tags": [
      "Cotton",
      "Linen",
      "Silk",
      "Canvas",
      "Upholstery",
      "Clearance-stock",
      "Production-friendly",
      "Value",
      "Large-range",
      "Trade-friendly"
    ],
    "more_info": "Saeeds Fabrics has traded from its present location since 2009 and prior to that operated as a street-trader in markets such as Dalston, Brixton and Tooting. Reviewers highlight the emphasis on natural fabrics like cotton and linen, while also noting the stock includes varied materials such as denim, leatherette, felt, canvas and large clearance lots. The staff are often described as knowledgeable and helpful, guiding customers who are working on sewing, upholstery or home projects. If you're after interesting prints, value for money or production-friendly quantities, the store delivers that—though it does maintain a functional layout and large-stock atmosphere rather than boutique service.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "General"
  },
  {
    "name": "William Gee",
    "id": "william_gee",
    "address": "2a Forest Rd, London E8 3BY",
    "category": "Fabric Shop",
    "phone": "020 7254 2451",
    "website": "http://www.williamgee.co.uk/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–5 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "William Gee is a long-standing supplier of haberdashery, sewing supplies, interfacings, linings and dress- and tailoring-related materials. Users often highlight the broad range of specialist supplies and reliable service. The store leans toward professional- and trade-usage rather than casual boutique shopping.",
    "lat": 51.54384,
    "lng": -0.06883,
    "tags": [
      "Haberdashery",
      "Trimmings",
      "Interfacings",
      "Linings",
      "Tailoring",
      "Student-Friendly",
      "Tool-Supply",
      "Specialist-Stock",
      "Trade-Focus",
      "Production-Use"
    ],
    "more_info": "Founded in 1906, William Gee has evolved from a small button and trimming business into a major player in UK textile trimmings and sewing supplies. The shop handles a wide spectrum of products—from calicos, woven fusibles, linings and interfacings to buttons, zips, threads and design-studio equipment. Reviews consistently note the selection and utility for both professionals and students alike, with one review emphasising the \"excellent quality\" of tools such as tailoring scissors. While the scale and trade focus mean the environment is less about luxury and more about function, many users value that mix of specialist stock and solid service.",
    "average_price": "Examples from public listings: some interfacings start from around £1.50/m for very simple fusible material. More specialist trims, design equipment or branded haberdashery will be higher,",
    "been": "NO",
    "approved": "NO",
    "overall": "Tailoring"
  },
  {
    "name": "MacCulloch & Wallis",
    "id": "macculloch_wallis",
    "address": "25-26 Poland St, London W1F 8QN",
    "category": "Fabric Shop",
    "phone": "020 7629 0311",
    "website": "https://www.macculloch-wallis.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10:30 am–5 pm\nSunday\tClosed",
    "pop_up": "MacCulloch & Wallis is a specialist supplier of fabrics, haberdashery, interlinings and tailoring materials. It offers a wide range of stock from silks and wools to technical interfacings—quite trade-oriented rather than boutique.",
    "lat": 51.51527,
    "lng": -0.13722,
    "tags": [
      "Tailoring",
      "Interlinings",
      "Haberdashery",
      "Specialist-Stock",
      "Trade-Focus",
      "Silks",
      "Wool",
      "Dressmaking",
      "Technical-Materials"
    ],
    "more_info": "Founded in 1902, MacCulloch & Wallis has developed a reputation for supplying tailoring and dressmaking fabrics along with specialist materials such as interlinings and interfacings. Their inventory includes Italian silks, Yorkshire wools and fabrics from other specialised sources; one review notes \"what appears to be the only green baize available in London\". The shop is valued by makers and professionals who need specialist, hard-to-find materials, though some users note the service and layout reflect its trade-focus rather than a luxury retail experience",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Tailoring"
  },
  {
    "name": "Holland & Sherry",
    "id": "holland_sherry",
    "address": "31 Savile Row, London W1S 3PT, UK",
    "category": "Fabric Shop",
    "phone": "020 7437 0404",
    "website": "https://apparel.hollandandsherry.com/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–5:30 pm\nSaturday\t10 am–5 pm\nSunday \tClosed",
    "pop_up": "Holland & Sherry is a premium cloth house known for high-end tailoring fabrics and luxury textiles. It caters to discerning clients rather than mass-market.",
    "lat": 51.51106,
    "lng": -0.14071,
    "tags": [
      "Luxury",
      "Tailoring",
      "Cashmere",
      "Wool",
      "Bespoke-Cloth",
      "High-End",
      "Heritage",
      "Couture",
      "Premium"
    ],
    "more_info": "Founded in 1836 by Stephen Holland and Frederick Sherry, Holland & Sherry has become a benchmark for excellence in luxury fabric manufacture, specialising in fine wools, cashmere, and silks for tailoring and couture. Their collections cover wool/cashmere flannels, linen-wools, tweeds and other high quality weaves. The brand appeals mostly to professional tailors and luxury fashion houses rather than hobby-sewers.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Tailoring"
  },
  {
    "name": "Joel & Son Fabrics",
    "id": "joel_son_fabrics",
    "address": "73-87 Church St, London NW8 8EU, UK",
    "category": "Fabric Shop",
    "phone": "020 7724 6895",
    "website": "https://www.joelandsonfabrics.com/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–5:30 pm\nSaturday\tClosed\nSunday \tClosed",
    "pop_up": "Joel & Son Fabrics is a high-end fabric store specialising in luxury textiles and couture-quality materials.",
    "lat": 51.52191,
    "lng": -0.17261,
    "tags": [
      "Luxury",
      "Couture",
      "Embroidery",
      "Silk",
      "Lace",
      "Designer-Fabric",
      "High-End",
      "Bridal-Stock",
      "Specialist"
    ],
    "more_info": "Joel & Son describes itself as a 'couture fabric specialist' and is frequently referenced as England's largest store of its kind. Its stock includes luxury silks, embroidered chiffons, high-end designer fabrics, velvets, laces and prints. One review characterised it as an 'Aladdin's cave of treasures' with fabrics from brands like Valentino, Versace and Swarovski among the offerings. The atmosphere is deeply oriented toward luxury and couture rather than budget or bulk stock.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Misan RETAIL",
    "id": "misan_retail",
    "address": "4 Berwick St, London W1F 0PE",
    "category": "Fabric Shop",
    "phone": "020 3556 9806",
    "website": "http://www.misan.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10 am–6 pm\nSunday \tClosed",
    "pop_up": "Misan Retail is known for high-quality fabrics including silks, lace, jacquards, brocades and premium tailoring cloths. The selection leans toward designer-level materials used in fashion, theatre and couture. The atmosphere is more curated and specialist than casual retail.",
    "lat": 51.51297,
    "lng": -0.13423,
    "tags": [
      "Silk",
      "Lace",
      "Jacquard",
      "Brocade",
      "Cashmere",
      "Tailoring",
      "Designer Fabric",
      "Couture",
      "Specialist Stock",
      "High End"
    ],
    "more_info": "The Soho branch focuses on elevated textiles sourced for designers and professional makers. Its stock includes fine European silks, French laces, cashmere coatings, luxury shirtings and fashion-forward seasonal fabrics. Customers visit this location when they need premium cloth with a refined finish, and reviews often mention the quality and specialist guidance. It is not positioned for budget or bulk buyers; instead it caters to those sourcing fabric for high-end garments, costumes or bespoke pieces.",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Misan WEST",
    "id": "misan_west",
    "address": "21 Goldhawk Rd, London W12 8QQ",
    "category": "Fabric Shop",
    "phone": "020 8811 2386",
    "website": "http://www.misan.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10 am–6 pm\nSunday \tClosed",
    "lat": 51.50272,
    "lng": -0.22443,
    "tags": [
      "Clearance",
      "Cotton",
      "Wool",
      "Silk",
      "Leather Hides",
      "Mixed Stock",
      "Value",
      "Trade Friendly",
      "Production Use",
      "Wide Range"
    ],
    "more_info": "Unlike the Soho branch, Misan West focuses on value and volume. It holds a wide range of fabrics from previous seasons, end-of-line rolls and mixed batches that suit students, small brands and makers working to a budget. Customers often visit for the clearance section, which includes reduced silks, wools, cottons and technical fabrics. The layout reflects its outlet purpose, and reviewers note that browsing through stock can be part of the process, but the pricing makes it worthwhile for production use or large projects.",
    "average_price": "Pricing is generally lower than the Soho branch due to clearance stock and surplus rolls, though exact ranges vary by type.",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Fabrics Galore",
    "id": "fabrics_galore",
    "address": "52, 54 Lavender Hill, London SW11 5RH",
    "category": "Fabric Shop",
    "phone": "020 7738 9589",
    "website": "https://www.fabricsgalore.co.uk/",
    "opening_hours": "Monday\t10 am–5 pm\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\t10 am–5 pm\nSaturday\t10 am–5 pm\nSunday\t Closed",
    "lat": 51.46611,
    "lng": -0.15297,
    "tags": [
      "Cotton",
      "Linen",
      "Wool",
      "Jersey",
      "Home-furnishing",
      "Value",
      "Wide-range",
      "Online",
      "Accessible",
      "Generalist"
    ],
    "more_info": "Fabrics Galore supplies a broad mix of fabrics including cottons, linens, wools, jerseys and home-furnishing materials. Reviewers highlight good value and a reliable online service. The retail format is more accessible and generalist than high-end specialist stores.",
    "average_price": "Fabrics Galore is a longstanding supplier known for a wide selection of dress- and home-furnishing fabrics. Users note the convenience of online ordering and a clear value positioning. Some reviews suggest the average cost is moderate (one blogger cited around £7 for a half-metre sample) and mention that the photo-colour accuracy sometimes varies. The business suits makers and hobby-sewers needing decent stock without premium mark-ups, though it does not carry the specialist tailoring or couture focus that some trade houses have.",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Huddersfield fine fabrics",
    "id": "huddersfield_fine_fabrics",
    "address": "Kingsland House, 122-124 Regent St., London W1B 5SA",
    "category": "Fabric Shop",
    "phone": "020 7437 1425",
    "website": "https://www.hfwltd.com/",
    "opening_hours": "Monday\t9 am–5 pm\nTuesday\t9 am–5 pm\nWednesday\t9 am–5 pm\nThursday\t9 am–5 pm\nFriday\t9 am–5 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "Huddersfield Fine Worsted is a cloth manufacturer and supplier specialising in premium wool fabrics and worsted suiting. The focus is on luxury and quality rather than budget stock.",
    "lat": 51.51091,
    "lng": -0.13828,
    "tags": [
      "Wool",
      "Worsted",
      "Suiting",
      "Luxury-Fabric",
      "British-Cloth",
      "Specialist",
      "Tailoring",
      "High-End",
      "Bespoke"
    ],
    "more_info": "Based in Yorkshire, Huddersfield Fine Worsted is internationally known for supplying fine wool and worsted cloth to tailors and design houses. Their fabrics include wool, wool-silk blends, and specialty suiting materials engineered for durability and finish. Public listings show pure wool tweeds from around £23.33/m (ex VAT) for certain weights and weaves. The brand appeals to bespoke tailoring and design professionals rather than casual hobby-sewers.",
    "average_price": "Examples: pure new wool tweeds listed at £23.33/m (ex VAT). Premium super-150s+ and specialty wool-silks will cost significantly more.",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Laurent Garigue",
    "id": "laurent_garigue",
    "address": "68 Pembroke Rd, London W8 6NX",
    "category": "Fabric Shop",
    "phone": "020 7371 1777",
    "website": "http://www.laurentgarigue.com/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–5:30 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "Laurent Garigue is a cloth house specialising in high-quality British-woven fabrics such as tweeds, mohairs, and luxurious suitings. Its stock is geared toward designers, couture and tailoring rather than everyday fashion or home-sewing.",
    "lat": 51.49446,
    "lng": -0.20126,
    "tags": [
      "Wool",
      "Tweed",
      "Mohair",
      "Suiting",
      "Luxury",
      "British-Cloth",
      "Designer Fabric",
      "Trade Focus",
      "Couture"
    ],
    "more_info": "The Garigue name has been associated with British fabrics since 1947, supplying Paris haute couture and fashion houses globally. Production remains rooted in Yorkshire and Scotland, and their collections include refined tweeds, brushed mohairs and evening wear wools in extensive colour ranges. The business operates more as a trade showroom than a general retail store, so customers typically book visits and expect specialist service and pricing suited to designer use.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "Shaukat Fabrics",
    "id": "shaukat_fabrics",
    "address": "170-172 Old Brompton Rd, London SW5 0BA, UK",
    "category": "Fabric Shop",
    "phone": "020 7373 6927",
    "website": "https://www.shaukat.co.uk/",
    "opening_hours": "Monday\t10 am–7 pm\nTuesday\t10 am–7 pm\nWednesday\t10 am–7 pm\nThursday\t10 am–7 pm\nFriday\t10 am–7 pm\nSaturday\t10 am–7 pm\nSunday\t Closed",
    "pop_up": "Shaukat Fabrics offers a wide selection of printed and plain fabrics, with a strong emphasis on cottons including large runs of designer printed cottons. The environment is more retail-friendly than high-end trade houses",
    "lat": 51.48958,
    "lng": -0.18975,
    "tags": [
      "Cotton",
      "Printed Fabric",
      "Designer Print",
      "Silk",
      "Wide Range",
      "Value",
      "Retail Stock",
      "Hobby-Sewer"
    ],
    "more_info": "Shaukat presents itself as a major stockist of printed cotton fabrics, including large volumes of iconic brand prints. Customers note the extensive range of cotton lawns, silks and canvas prints and often highlight that the shop is good value for designer-print fabrics. The service leans toward everyday makers and hobbyists, rather than exclusively large-scale manufacturing or couture.",
    "average_price": "Examples from public browsing show premium printed cotton lawns priced at approximately £22.92/m, reflecting the branded and designer-print nature of the stock.",
    "been": "NO",
    "approved": "NO",
    "overall": "Luxury"
  },
  {
    "name": "GH Leather",
    "id": "gh_leather",
    "address": "26 Cambridge Heath Rd, Bethnal Green, London E1 5QH",
    "category": "Leather",
    "phone": "020 7538 4500",
    "website": "https://leathermerchants.shop/",
    "opening_hours": "Monday\t9 am–4:30 pm\nTuesday\t9 am–4:30 pm\nWednesday\t9 am–4:30 pm\nThursday\t9 am–4:30 pm\nFriday\t9 am–3 pm\nSaturday\tClosed\nSunday \tClosed",
    "pop_up": "GH Leathers supplies a broad selection of leathers—vegetable-tanned, chrome-tanned, cowhides, lambskins and suedes—aimed at makers, designers and crafters. The focus is on material variety and technical support rather than luxury branding.",
    "lat": 51.52084,
    "lng": -0.05596,
    "tags": [
      "Vegetable-tanned",
      "Chrome-tanned",
      "Cowhide",
      "Lambskin",
      "Suede",
      "Maker-friendly",
      "Craft-stock",
      "Large-range"
    ],
    "more_info": "GH Leathers has warehouse-and-showroom operations offering a wide range of leather types including craft-grade skins and hides. Customers comment on the ability to source both small quantities for prototyping and larger lots for production, plus requestable sample pieces to assess texture and finish. The environment is practical, geared toward makers who prioritise material choice and consistent supply.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "Alma Leather",
    "id": "alma_leather",
    "address": "12 Greatorex St, London E1 5NF",
    "category": "Leather",
    "phone": "020 7377 0762",
    "website": "https://www.almaleather.co.uk/",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\tClosed\nSunday \tClosed",
    "pop_up": "ALMA Leather specialises in premium hides for interiors, accessories and fashion, with an emphasis on quality finishes and heritage craft. The offering leans toward high-end rather than volume bulk.",
    "lat": 51.51776,
    "lng": -0.06705,
    "tags": [
      "Luxury-leather",
      "Designer-grade",
      "Interior-leather",
      "Accessory-leather",
      "Bespoke-finish",
      "High-quality"
    ],
    "more_info": "Founded in 1938, ALMA Leather has built a reputation for supplying high-quality leathers for upscale applications—furnishings, interiors, couture accessories and film/TV costume. Their selections include luxury skins, bespoke finishes and specialist treatments. The environment favours design-led users who prioritise material uniqueness and finish over commodity price.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "J.T.BATCHELOR",
    "id": "j_t_batchelor",
    "address": "9-10 Culford Mews, London N1 4DZ",
    "category": "Leather",
    "phone": "020 7254 2962",
    "website": "http://jtbatchelor.com/",
    "opening_hours": "Monday\t10 am–5 pm\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\t10 am–5 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "J T Batchelor is a specialist hide and leather supplier offering skins, tools and hardware for leather-goods makers and craft professionals. The focus is on hide quality combined with craft usability.",
    "lat": 51.5461,
    "lng": -0.08257,
    "tags": [
      "Hide-supplier",
      "Leather_goods",
      "Full-grain",
      "Leather-tools",
      "Maker-friendly",
      "Craft-stock"
    ],
    "more_info": "Located in London's maker-circuit, J T Batchelor has served leather-goods makers, hobbyists and professionals for decades. The stock includes full-grains, splits, tooling hides and leather-working hardware such as presses or rivet machines. Reviewers point out that it's a 'one-stop shop' for anyone doing leather-goods production or serious hobby leather work. The experience is tool-and-material focused rather than purely retail fashion.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "Walter Reginald",
    "id": "walter_reginald",
    "address": "Unit 3, Deltec House Maple Grove Business Centre, Lawrence Rd, Cranford, Hounslow TW4 6DR",
    "category": "Leather",
    "phone": "020 7481 2233",
    "website": "http://www.walterreginald.com/",
    "opening_hours": "Monday\t10 am–4 pm\nTuesday\t10 am–4 pm\nWednesday\t10 am–4 pm\nThursday\t10 am–4 pm\nFriday\t11 am–2 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Walter Reginald is a long-established leather and suede merchant known for high-quality hides, sheepskins and bespoke finishes for fashion, upholstery and footwear",
    "lat": 51.46489,
    "lng": -0.39975,
    "tags": [
      "Premium-hide",
      "Suede",
      "Sheepskin",
      "Leather-finishes",
      "Footwear-leather",
      "Upholstery-leather",
      "Bespoke-colour"
    ],
    "more_info": "Operating since 1948, Walter Reginald is recognised for supplying premium leathers, suedes and skins suited to garments, footwear, accessories and upholstery. Their stock spans cowhide, lamb nappa, goat suede, pigskin and exotic finishes including embossing and print. Many designer-users cite the company for its bespoke colour-matching and finish-development service as well as reliable premium supply.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "Olympic Leather",
    "id": "olympic_leather",
    "address": "check if still open",
    "category": "Leather",
    "pop_up": "Olympic Leather is a leather wholesaler offering batches of skins suitable for production or large-volume use rather than boutique retail.",
    "tags": [
      "Wholesale-leather",
      "Production-stock",
      "Batch-buy",
      "Hide-supplier",
      "Volume-use"
    ],
    "more_info": "Registered in London, Olympic Leather supplies bulk lots and hides for makers needing volume or production-ready stock. While less is published about their consumer experience, they are positioned toward wholesale supply rather than designer-luxury retail. This makes them more suitable for makers who prioritise availability and scale.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "The London Leather Workshop",
    "id": "the_london_leather_workshop",
    "address": "Unit 7, Thames-Side Studios, 002-003 Harrington Way, Warspite Rd, London SE18 5AU",
    "category": "Leather",
    "phone": "07428 374902",
    "website": "https://www.thelondonleatherworkshop.com/",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "The London Leather Workshop offers leather-craft courses and supplies alongside design and manufacturing services for accessories and bags.",
    "lat": 51.49438,
    "lng": 0.04394,
    "tags": [
      "Leather-craft",
      "Bag-making",
      "Vegan-leather",
      "Deadstock-skins",
      "Workshop",
      "Maker-education",
      "Accessory-manufacturing"
    ],
    "more_info": "The London Leather Workshop combines material supply with education and manufacturing services. They offer hands-on courses in bag and accessory making, leather and vegan-leather hides sourced from Italian deadstock, and full manufacturing/tailoring support for designers and start-ups. Reviewers highlight the combination of training and material access as unique. The space is creative and service-oriented rather than pure merchant stock.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Leather"
  },
  {
    "name": "Last yarn",
    "id": "last_yarn",
    "address": "3a, Crawley Road Studios, 38 Crawley Rd, London N22 6AG, UK",
    "category": "Fabric Shop",
    "phone": "020 8740 7349",
    "website": "https://lastyarn.com",
    "opening_hours": "Monday\tClosed\nTuesday\t9 am–2 pm\nWednesday\tClosed\nThursday\t9 am–2 pm\nFriday\t9 am–2 pm\nSaturday\tClosed\nSunday \tClosed",
    "pop_up": "Last Yarn is a platform and studio specialising in surplus and deadstock fabrics—luxury, designer-leftover textiles offered by the metre with a sustainability focus.",
    "lat": 51.59398,
    "lng": -0.09237,
    "tags": [
      "Deadstock",
      "Surplus-fabric",
      "Luxury-leftover",
      "Sustainability",
      "Designer-fabric",
      "Unique-stock",
      "Ethical",
      "Small-bundle"
    ],
    "more_info": "Last Yarn connects designers, mills and makers to fabric surplus that would otherwise go unused or to waste. It emphasises ethical reuse: luxury fabrics, off-runs and designer leftovers are available for users who value sustainability and uniqueness. Reviewers highlight its mission of \"old threads still got it\" and its operation as a curated market of ends-and-rolls rather than a traditional retail fabric shop.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "Ray stitch",
    "id": "ray_stitch",
    "address": "66 Essex Rd, London N1 8LR, UK",
    "category": "Fabric Shop",
    "website": "https://www.raystitch.co.uk/",
    "opening_hours": "Monday\t10 am–6:30 pm\nTuesday\t10 am–6:30 pm\nWednesday\t10 am–6:30 pm\nThursday\t10 am–6:30 pm\nFriday\t10 am–6:30 pm\nSaturday\t10 am–6:30 pm\nSunday\t11 am–5 pm",
    "pop_up": "Ray Stitch offers a well-curated range of dressmaking fabrics, haberdashery and sewing tools, paired with a full calendar of workshops. The space is friendly to hobbyists and makers rather than large-scale production.",
    "lat": 51.53798,
    "lng": -0.09942,
    "tags": [
      "Dressmaking",
      "Haberdashery",
      "Fabric",
      "Workshop",
      "Tools",
      "Sustainable",
      "Maker-friendly",
      "Organic"
    ],
    "more_info": "The store was founded with the idea of bringing together quality fabrics, strong tools and creative classes under one roof. Customers often mention that the selection of organic or sustainably-produced fabrics is a highlight, and that the sewing school component (with machine, pattern cutting and repair classes) adds a community dimension. The feel is boutique and educational rather than wholesale or purely trade.",
    "average_price": "Examples show wool tweeds at around £17.50/m, and mixed fabric ranges running moderate to higher depending on fibre and finish",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "The Cloth House",
    "id": "the_cloth_house",
    "address": "130 Royal College St, London NW1 0TA",
    "category": "Fabric Shop",
    "phone": "020 7485 6247",
    "website": "http://www.clothhouse.com/",
    "opening_hours": "Monday\t10 am–1 pm, 2–4 pm\nTuesday\t10 am–1 pm, 2–4 pm\nWednesday\t10 am–1 pm, 2–4 pm\nThursday\t10 am–1 pm, 2–4 pm\nFriday\tClosed\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "The Cloth House is a family-run business with a long heritage, specialising in quality fabrics—linen, denim, home-furnishing cloths and artisanal prints. It's more about fabric exploration than large-volume trade supply.",
    "lat": 51.5403,
    "lng": -0.13685,
    "tags": [
      "Natural-fibre",
      "Linen",
      "Cotton",
      "Denim",
      "Vintage-inspired",
      "Home-furnishing",
      "Artisanal",
      "Fabric exploration"
    ],
    "more_info": "Established in 1984, the Cloth House has traded from its Camden townhouse studio for decades, offering makers and crafters access to natural fibres and vintage-inspired textiles. Reviews highlight its calm, charming atmosphere and strong selection of cottons, linens and block prints. The business is oriented toward thoughtful fabric use and creative sewing rather than high-volume production or discount bulk buys.",
    "average_price": "Listings show block print fabrics around £17.40/m, indicating mid-to-upper range for quality artisanal textiles.",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "The Cloth Shop",
    "id": "the_cloth_shop",
    "address": "290 Portobello Rd, London W10 5TE",
    "category": "Fabric Shop",
    "phone": "020 8968 6001",
    "website": "http://www.theclothshop.net/",
    "opening_hours": "Monday\tClosed\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10 am–6 pm\nSunday\t Closed",
    "pop_up": "The Cloth Shop has a strong focus on linens, cottons and home-textile fabrics, offering both retail and home-ware suppliers. It differs from The Cloth House in size, format and clientele.",
    "lat": 51.51949,
    "lng": -0.20753,
    "tags": [
      "Linen",
      "Cotton",
      "Home-textile",
      "Block-print",
      "Natural-fibre",
      "Volume-use",
      "Home-ware",
      "Designer-fabric"
    ],
    "more_info": "Founded in 1982 and located on Portobello Road, The Cloth Shop serves designers, homes and hobby-sewers looking for textured fabrics, block prints, vintage textiles and natural-fibre homeware cloths. It's more oriented to volume and functional pieces (like curtain/lining fabrics) than the smaller artisanal-shop feel of The Cloth House. As such, while there is overlap in fabric type and natural fibres, the scope and audience differ.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "The New Craft House",
    "id": "the_new_craft_house",
    "address": "32 Bocking St, London E8 3FP",
    "category": "Fabric Shop",
    "phone": "07400 151664",
    "website": "http://www.thenewcrafthouse.com/",
    "opening_hours": "Monday\tClosed\nTuesday\tClosed\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\t10 am–5 pm\nSaturday\t10 am–5 pm\nSunday \t10 am–5 pm",
    "pop_up": "The New Craft House specialises in deadstock and designer-leftover fabrics, making unique textile finds available to makers and students. The focus is on sustainability and one-off materials rather than standard bulk stock.",
    "lat": 51.53736,
    "lng": -0.05859,
    "tags": [
      "Deadstock",
      "Designer-leftover",
      "Sustainability",
      "Unique-stock",
      "Small-batch",
      "Maker-friendly"
    ],
    "more_info": "This shop sources surplus fabrics from designers and studios that would otherwise go unused, giving home-sewers access to premium cloth at more accessible sizes or quantities. Reviews highlight the freshness of the collections and the ethical angle—\"everything is designer deadstock\" is one comment. The environment supports creativity and sustainability rather than high-volume production.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "Simply Fabrics",
    "id": "simply_fabrics",
    "address": "57 Atlantic Rd, London SW9 8PZ, UK",
    "category": "Fabric Shop",
    "phone": "020 3602 0723",
    "website": "https://www.simplyfabrics.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t11 am–6 pm\nWednesday\t10 am–6 pm\nThursday\tClosed\nFriday\t11 am–6 pm\nSaturday\t10 am–6 pm\nSunday \t12–4 pm",
    "pop_up": "Simply Fabrics offers a broad range of tailoring wools, linens, printed cottons and end-of-roll fabrics at accessible price points. The store suits makers and students looking for good cloth at fair value.",
    "lat": 51.46155,
    "lng": -0.11129,
    "tags": [
      "Tailoring",
      "Wool",
      "Linen",
      "End-of-roll",
      "Value",
      "Student-friendly",
      "Wide-range"
    ],
    "more_info": "Located near Brixton Market, Simply Fabrics is described in reviews as a place where tailoring wools start around £6 per metre, and end-of-roll lots can drop to £2-£3 per metre. The focus is on value and availability rather than luxury sourcing. Customers include students, beginner tailors and hobby-sewers who appreciate the willingness to sell smaller cuts and the steady flow of stock.",
    "average_price": "CALL TO FIND OUT - Tailoring wools approx £6/m, end-of-roll pieces as low as ~£2-£3/m according to user review.",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "Mermaid Fabrics",
    "id": "mermaid_fabrics",
    "address": "18A Lower Clapton Rd, London E5 0PD",
    "category": "Fabric Shop",
    "phone": "020 8985 3694",
    "website": "https://mermaidfabrics.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10 am–6 pm\nSunday\t Closed",
    "pop_up": "Mermaid Fabrics stocks a wide selection of general-use dress-weight fabrics, upholstery materials and discount bulk options. The store caters to home-sewers and makers who prioritise range and practicality.",
    "lat": 51.55054,
    "lng": -0.05183,
    "tags": [
      "Dress-fabric",
      "Upholstery",
      "Bulk-stock",
      "General-use",
      "Value",
      "Wide-choice"
    ],
    "more_info": "Based in Hackney, Mermaid Fabrics advertises \"huge new ranges\" and offers free parking on request—indicating a user-friendly setup for makers buying in person. Customers mention the breadth of choice across dress fabrics and home-textiles, and the value of being able to browse many rolls in one place. The feel is utility-focused rather than specialist couture.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "Borovick Fabrics",
    "id": "borovick_fabrics",
    "address": "16 Berwick St, London W1F 0HP",
    "category": "Fabric Shop",
    "phone": "020 7437 2180",
    "website": "http://borovickfabricsltd.co.uk/",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\t9 am–5 pm\nSunday \tClosed",
    "pop_up": "Borovick Fabrics is a long-established textile house offering a rich variety of fabrics including silks, chiffons, bridal cloths, brocades and theatrical materials. The stock is specialist and broad in texture rather than basic.",
    "lat": 51.5136,
    "lng": -0.13469,
    "tags": [
      "Bridal",
      "Silk",
      "Brocade",
      "Theatre-fabric",
      "Specialist",
      "Texture-rich",
      "Long-standing"
    ],
    "more_info": "Founded in 1932 in Soho, Borovick has built a worldwide reputation for supplying textiles to fashion, film, theatre and students. The range spans from bridal silks to technical sportswear fabrics. Reviews highlight the wealth of textures and finishes available in one location, and the knowledgeable service behind it",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Affordable"
  },
  {
    "name": "Empee Silks",
    "id": "empee_silks",
    "address": "31 Commercial Rd, London N18 1TP",
    "category": "Fabric Shop",
    "phone": "020 8887 6000",
    "website": "http://www.wholesalefabrics.co.uk/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–2:30 pm\nSaturday\tClosed\nSunday\t 8:30 am–3 pm",
    "pop_up": "Empee Silks is part of a large fabric house offering a broad range of materials including silks, dress fabrics, prints and trade-stock. The environment is geared toward makers, wholesalers and production rather than small hobby purchases.",
    "lat": 51.60886,
    "lng": -0.07417,
    "tags": [
      "Silk",
      "Dress-fabric",
      "Wholesale",
      "Large-stock",
      "Trade-friendly",
      "Production-use",
      "Variety"
    ],
    "more_info": "Empee Silks has built up a significant wholesale operation, stocking millions of metres of fabric and serving design studios, bridal manufacturers and production houses as well as retail customers. Reviews note the sheer scale of the stock (\"one of the most extensive ranges of fabrics in the UK\") and highlight its usefulness when quantity, variety and value are all important. The space is warehouse-informed, prioritising stock and selection over boutique styling.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Silks"
  },
  {
    "name": "Pongees Silk",
    "id": "pongees_silk",
    "address": "4, Fountain House, Chapel Pl, Rivington St, London EC2A 3DQ",
    "category": "Fabric Shop",
    "phone": "020 7739 9130",
    "website": "https://www.pongees.co.uk/",
    "opening_hours": "Monday\t10 am–4 pm\nTuesday\t10 am–4 pm\nWednesday\t10 am–4 pm\nThursday\t10 am–4 pm\nFriday\t10 am–4 pm\nSaturday\tClosed\nSunday\t Closed",
    "pop_up": "Pongees specialises in luxury silks including chiffons, crepes, organzas and other fine finishes, with a showroom that welcomes designers and students alike.",
    "lat": 51.52636,
    "lng": -0.08184,
    "tags": [
      "Silk",
      "Luxury",
      "Couture-fabric",
      "Chiffon",
      "Organza",
      "Bridal",
      "Designer",
      "Low-minimum",
      "Specialist"
    ],
    "more_info": "Established over 90 years ago, Pongees offers an extensive selection of silks for fashion, bridal, lingerie, couture and interiors. It emphasises quality finishes and low minimum order quantities (from 1 metre) making it accessible for smaller designers as well as industry users. Customers often highlight the showroom experience and the specialist nature of the silks on offer.",
    "average_price": "CALL TO FIND OUT- Clearance lines are indicated 'from £5–£20/m' in some categories; given the luxury positioning many silks will cost more.",
    "been": "NO",
    "approved": "NO",
    "overall": "Silks"
  },
  {
    "name": "Unique Fabrics",
    "id": "unique_fabrics",
    "address": "28 Goldhawk Rd, London W12 8DH",
    "category": "Fabric Shop",
    "phone": "07427 842219",
    "website": "https://unique-fabrics.co.uk/",
    "opening_hours": "Monday\t9 am–6:30 pm\nTuesday\t9 am–6:30 pm\nWednesday\t9 am–6:30 pm\nThursday\t9 am–6:30 pm\nFriday\t9 am–6:30 pm\nSaturday\t9 am–6:30 pm\nSunday\t Closed",
    "pop_up": "Unique Fabrics emphasises premium silks and fabric for high-end applications, offering a wide range of silks, prints and specialist cloth.",
    "lat": 51.50277,
    "lng": -0.22541,
    "tags": [
      "Silk",
      "Premium",
      "Print-silk",
      "Specialist",
      "High-end",
      "Dress-fabric",
      "Maker-oriented"
    ],
    "more_info": "This family-owned business has grown from modest beginnings into one of the UK's wider ranges of silks. It markets itself as 'House of Silk' and serves users who prioritise refined fabrics and finish. The focus is on quality over quantity and the materials on offer often lean toward specialist uses rather than everyday dress fabrics.",
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Silks"
  },
  {
    "name": "A One Fabrics",
    "id": "a_one_fabrics",
    "address": "50-52 Goldhawk Rd, London W12 8DH",
    "category": "Fabric Shop",
    "phone": "020 8740 7349",
    "opening_hours": "Monday\t9:30 am–6:30 pm\nTuesday\t9:30 am–6:30 pm\nWednesday\t9:30 am–6:30 pm\nThursday\t9:30 am–6:30 pm\nFriday\t9:30 am–6:30 pm\nSaturday\t9:30 am–6:30 pm\nSunday\t Closed",
    "lat": 51.5026,
    "lng": -0.22634,
    "average_price": "CALL TO FIND OUT",
    "been": "NO",
    "approved": "NO",
    "overall": "Silks"
  },
  {
    "name": "Broadwick Silks",
    "id": "broadwick_silks",
    "address": "Unit G8, Building A, Wembley Commercial Centre\nEast Lane, Wembley HA9 7UR",
    "category": "Fabric Shop",
    "phone": "020 7734 3320",
    "website": "https://www.broadwicksilks.com",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\tClosed\nSunday \tClosed",
    "pop_up": "Broadwick Silks supplies silks and other fashion fabrics with a strong focus on theatre, film, bridal and high-impact fabrics. The service includes appointments and tailored support for demanding uses.",
    "lat": 51.56267,
    "lng": -0.3054,
    "tags": [
      "Silk",
      "Theatre-fabric",
      "Bridal",
      "Fashion-fabric",
      "Specialist",
      "Production-use",
      "High-stock"
    ],
    "more_info": "Suggesting a specialty in production and high-visibility projects, Broadwick Silks has over 14,000 fabrics in stock and invites students with grouped visits (\"join up with a couple of friends for a three-person visit\") indicating a trade-oriented but accessible environment. The range suits designers, costume-makers and bridal-wear producers rather than casual hobby sewing alone.",
    "average_price": "CALL TO FIND OUT- student discount?",
    "been": "NO",
    "approved": "NO",
    "overall": "Silks"
  },
  {
    "name": "London Trimmings",
    "id": "london_trimmings",
    "address": "41B Antill Rd, London N15 4AS, UK",
    "category": "Trimming",
    "phone": "020 7790 2233",
    "website": "http://www.londontrimmings.co.uk/",
    "opening_hours": "Monday\t9:30 am–5 pm\nTuesday\t9:30 am–5 pm\nWednesday\t9:30 am–5 pm\nThursday\t9:30 am–5 pm\nFriday\t9:30 am–12 pm, 3–5 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "ondon Trimmings stocks a wide range of trims, ribbons, elastics, zips and basic haberdashery for garment construction. The shop is practical and trade-friendly rather than boutique.",
    "lat": 51.58585,
    "lng": -0.06769,
    "tags": [
      "Trimmings",
      "Elastic",
      "Zips",
      "Binding",
      "Haberdashery",
      "Value",
      "Trade Friendly",
      "Wide Range"
    ],
    "more_info": "Known for its large selection of everyday finishing items, London Trimmings is used by students, makers and small brands who need reliable hardware, elastics, bindings and zips at fair prices. The shop's atmosphere is functional, with shelves packed according to type and purpose. Reviews often mention the convenience of finding most garment-finishing essentials in one place and the straightforward service.",
    "average_price": "Pricing is generally low-to-moderate, especially on elastics, zips and common trims.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Fan New Trimmings",
    "id": "fan_new_trimmings",
    "address": "47 Berwick St, London W1F 8SQ",
    "category": "Trimming",
    "phone": "020 7637 0307",
    "website": "http://www.newtrimmings.co.uk/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t11 am–6 pm\nSunday\tClosed",
    "pop_up": "Fan New Trimmings offers a dense and varied selection of trims, from ribbons and appliqués to cords, closures and decorative pieces. The shop leans toward creative and decorative garment finishing.",
    "lat": 51.51528,
    "lng": -0.1362,
    "tags": [
      "Appliqué",
      "Ribbon",
      "Decorative Trim",
      "Sequins",
      "Braid",
      "Costume",
      "Creative",
      "Wide Choice"
    ],
    "more_info": "Popular with costume designers, students and embellishment-focused makers, Fan New Trimmings is known for its tightly packed walls of colourful trims, sequins, fancy braids and small decorative items. Customers often note that it's one of the better places for unusual or specific trims, and the atmosphere encourages browsing through dense stock.",
    "average_price": "Most decorative trims sit in the lower-to-mid price bracket, with specialty appliqués costing more.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Durable Fastners",
    "id": "durable_fastners",
    "address": "430 Kingsland Rd, London E8 4AA",
    "category": "Trimming",
    "phone": "020 7254 6713",
    "website": "http://www.durablefasteners.co.uk/",
    "pop_up": "Durable Fasteners specialises in hardware such as snaps, studs, eyelets, rivets and other metal fastenings for garments and accessories.",
    "lat": 51.54213,
    "lng": -0.0758,
    "tags": [
      "Fasteners",
      "Snaps",
      "Eyelets",
      "Studs",
      "Rivets",
      "Hardware",
      "Tailoring",
      "Leatherwork",
      "Production Use"
    ],
    "more_info": "This shop focuses on the technical side of garment finishing, supplying metal components used in tailoring, denim, leatherwork and accessories. Reviews highlight the reliability of the hardware and the usefulness of bulk quantities for production or repeated sampling. The environment is functional and aimed at professionals who need specific fasteners rather than decorative trims.",
    "average_price": "Prices vary by metal type and quantity, but bulk packs and trade rates tend to offer good value for makers.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Europa Trimmings",
    "id": "europa_trimmings",
    "address": "13-15 Lever St, London EC1V 3QU",
    "category": "Trimming",
    "phone": "020 7253 3980",
    "website": "http://www.europatrimmings.co.uk/",
    "opening_hours": "Monday\tClosed\nTuesday\t10 am–4 pm\nWednesday\t10 am–4 pm\nThursday\t10 am–4 pm\nFriday\tClosed\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Europa Trimmings specialises in textile fastenings and hardware—especially zips and trims—for garments and industrial uses. The emphasis is on technical specification and trade supply rather than decorative haberdashery.",
    "lat": 51.52649,
    "lng": -0.09926,
    "tags": [
      "Zips",
      "Fastenings",
      "Threads",
      "Technical-Trim",
      "Production-Use",
      "Trade-Friendly",
      "Hardware",
      "Value"
    ],
    "more_info": "Established in London in 1974, Europa Trimmings is a family-run business that evolved from couture manufacture into a specialist supplier of trims, threads and fastenings, with a leading role as a UK distributor of a major zip brand. The team offers advice on choosing the correct fastening for different fabric and design needs, and customers include manufacturers, costume-makers and production houses. The environment is practical and solution-driven rather than decorative or boutique.",
    "average_price": "Because it serves production and trade orders, pricing ranges vary widely depending on lot size, specification and bespoke requirements—volume buyers usually secure lower unit rates.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Taylor's Buttons",
    "id": "taylor_s_buttons",
    "address": "22 Cleveland St, London W1T 4JB",
    "category": "Trimming",
    "phone": "020 7436 9988",
    "website": "http://www.taylorsbuttons.co.uk/",
    "opening_hours": "Monday\tClosed\nTuesday\t11 am–3:30 pm\nWednesday\t11 am–3:30 pm\nThursday\tClosed\nFriday\tClosed\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Taylor's Buttons specialises in hand-covered fabric buttons, vintage and custom buttons, and bespoke belt and buckle services for bridal, tailoring and costume work.",
    "lat": 51.51956,
    "lng": -0.13751,
    "tags": [
      "Buttons",
      "Bespoke",
      "Covered buttons",
      "Bridal",
      "Vintage-buttons",
      "Specialist hardware",
      "Tailoring accessories"
    ],
    "more_info": "With over 100 years of history, Taylor's offers a niche service of bespoke covered buttons made by hand, dyed to match or produced to order. They serve tailors, bridal wear designers and costume makers. One customer describes it as 'veritable Aladdin's cave of wonderful buttons'. \nTaylors Buttons\n The focus is on specialist detail and bespoke finishing rather than general button retail or mass haberdashery.",
    "average_price": "Pricing is bespoke and varies considerably depending on material and finish; exact meter-by-meter equivalent is not provided but prices are premium for custom work.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "V V Rouleaux",
    "id": "v_v_rouleaux",
    "address": "102 Marylebone Ln, London W1U 2QD",
    "category": "Trimming",
    "phone": "020 7224 5179",
    "website": "http://www.vvrouleaux.com/",
    "opening_hours": "Monday\t10 am–6 pm\nTuesday\t10 am–6 pm\nWednesday\t10 am–6 pm\nThursday\t10 am–6 pm\nFriday\t10 am–6 pm\nSaturday\t10 am–6 pm\nSunday\tClosed",
    "pop_up": "V V Rouleaux offers an abundant selection of decorative trims—ribbons, braids, cords, feathers, appliqués—serving those seeking creative embellishment.",
    "lat": 51.51776,
    "lng": -0.15069,
    "tags": [
      "Ribbon",
      "Braid",
      "Cord",
      "Decorative Trim",
      "Millinery",
      "Embellishment",
      "Colour-Focus",
      "Creative"
    ],
    "more_info": "Founded in 1990, V V Rouleaux has carved out a niche for fashion and interior-trim supply, where colour, texture and decorative detail are central. The store is a destination for embellishment, where trims transition from functional to expressive—used in haute couture, bridal, interior, millinery and creative projects. Customers often mention the inspirational stock walls and variety of finishes.",
    "average_price": "Decorative trims are priced according to material, width, finish and brand—many fall in the modest-to-mid price band, with bespoke or rare trims at higher cost.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "YKK Showroom",
    "id": "ykk_showroom",
    "address": "154 Commercial St, London E1 6NU",
    "category": "Trimming",
    "phone": "020 7448 1331",
    "website": "https://ykklondonshowroom.com/",
    "opening_hours": "Monday\tClosed\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\tClosed\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "The YKK Showroom presents the full range of YKK zips, fasteners and technical closures for fashion, sportswear and accessories. It functions more as a sample and specification space than a retail shop.",
    "lat": 51.52198,
    "lng": -0.07609,
    "tags": [
      "Zips",
      "Fasteners",
      "Technical Hardware",
      "Outerwear",
      "Sportswear",
      "Trade Focus",
      "Sampling",
      "Specification Space"
    ],
    "more_info": "The showroom is used by designers, pattern cutters and production teams who need to choose the correct YKK product for a garment or accessory. Visitors can handle different zip types, weights, tapes and finishes, including specialist pieces for outerwear, leather goods, uniforms and technical sportswear. It's primarily a place to view options, match colours, confirm specifications and place trade orders rather than buy small quantities on the spot. The environment is professional and technical, with staff advising on compatibility and performance rather than purely aesthetic trims.",
    "average_price": "Pricing varies depending on product type and order size. As a specification showroom, exact prices are arranged through trade ordering rather than over-the-counter sales.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Alfa-G",
    "id": "alfa_g",
    "address": "91 Great Russell St, London WC1B 3PS",
    "category": "Trimming",
    "phone": "020 3105 7167",
    "website": "http://www.alfag.co.uk/",
    "opening_hours": "Monday\t10 am–12:30 pm, 2–4:30 pm\nTuesday\t10 am–12:30 pm, 2–4:30 pm\nWednesday\t10 am–12:30 pm, 2–4:30 pm\nThursday\t10 am–12:30 pm, 2–4:30 pm\nFriday\t10 am–12:30 pm, 2–4:30 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Alfa-G is a haberdashery and trimmings house offering ribbons, braids, fasteners and accessories aimed at fashion, craft and tailoring. The selection spans basic to premium trims.",
    "lat": 51.518,
    "lng": -0.12737,
    "tags": [
      "Trimmings",
      "Ribbon",
      "Braid",
      "Fasteners",
      "Haberdashery",
      "Value",
      "Widely-ranged",
      "Maker-friendly"
    ],
    "more_info": "Located centrally, Alfa-G carries Italian haberdashery, quality ribbons, satin bindings, plated trims and a wide array of fastenings. Reviews show that some items start from very low unit pricing (e.g., ribbons from ~£0.34) which suggests good entry-level value. \nThe store suits students and makers as well as production users since the product range covers both everyday and more decorative finishes.",
    "average_price": "Some trims like grosgrain ribbons are listed from around £0.34/m.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Fabians Haberdashery Trimmings",
    "id": "fabians_haberdashery_trimmings",
    "address": "Unit 110, Railway Arches, Cannon St Rd, London E1 2LY",
    "category": "Trimming",
    "phone": "020 7481 1543",
    "website": "http://www.fabianstrimmings.co.uk/",
    "opening_hours": "Monday\t10 am–4:30 pm\nTuesday\t10 am–4:30 pm\nWednesday\t10 am–4:30 pm\nThursday\t10 am–4:30 pm\nFriday\t10 am–3 pm\nSaturday\tClosed\nSunday\t8:30 am–12:30 pm",
    "pop_up": "Fabians is a wholesale-oriented trimmings and haberdashery supplier with buttons, fasteners, buckles and related accessories, aimed at dress manufacturers, tailors and alteration shops.",
    "lat": 51.51146,
    "lng": -0.06566,
    "more_info": "Fabians has an extensive catalogue of buttons, zips, hood fasteners, threads and accessories. For example, metal buttons are listed at £4–£7 for 100 pcs in recent listings. \nThey emphasise service for trade and bulk buyers, listing minimum order spends and positioning more toward production or wholesale rather than hobby retail.",
    "average_price": "Metal buttons in batches (100 pcs) are around £4–£7 in recent listings.",
    "been": "NO",
    "approved": "NO",
    "overall": "Trimmings"
  },
  {
    "name": "Hand & Lock",
    "id": "hand_lock",
    "address": "86 Margaret St, London W1W 8TE",
    "category": "Knit/Embroidery",
    "phone": "020 7580 7488",
    "website": "http://www.handembroidery.com/",
    "opening_hours": "Monday\t9 am–5:30 pm\nTuesday\t9 am–5:30 pm\nWednesday\t9 am–5:30 pm\nThursday\t9 am–5:30 pm\nFriday\t9 am–5:30 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Hand & Lock is a historic London embroidery house specialising in advanced embellishment, goldwork, badges and bespoke embroidery services.",
    "lat": 51.51698,
    "lng": -0.14521,
    "tags": [
      "Embroidery",
      "Goldwork",
      "Bespoke-embellishment",
      "Couture",
      "Specialist",
      "Heritage"
    ],
    "more_info": "Tracing its roots to 1767, Hand & Lock supplies military insignia, couture houses and creative studios, and offers hand-embroidery kits and courses. \nThe focus is on craftsmanship and specialist skill rather than mass-market knit or basic trims. Average prices depend on complexity and materials.",
    "average_price": "Hand embroidery kits typically sit around the mid tens of pounds, while classes and bespoke commissions are priced significantly higher depending on complexity and materials.",
    "been": "NO",
    "approved": "NO",
    "overall": "Knit/Embroidery"
  },
  {
    "name": "The London Embroidery Studio",
    "id": "the_london_embroidery_studio",
    "address": "Arch 38 Ermine Mews, Laburnum St, London E2 8BF",
    "category": "Knit/Embroidery",
    "phone": "07366 325888",
    "website": "https://www.londonembroiderystudio.com/",
    "opening_hours": "Monday\t10 am–5 pm\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–6 pm\nFriday\t10 am–5 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "The London Embroidery Studio offers bespoke machine and hand-embroidery services, decorative stitching and textile art production for fashion and interiors.",
    "lat": 51.53563,
    "lng": -0.07604,
    "tags": [
      "Embroidery studio",
      "Decorative stitching",
      "Beading",
      "Applique",
      "Fashion-embellishment",
      "Bespoke"
    ],
    "more_info": "Based in a railway arch in East London, the studio works with fashion brands and designers to realise detailed embroidery, beading, sequins, ribboning and applique. \nWhile not a traditional retail yarn/knit shop, it serves makers and designers needing advanced surface-embellishment rather than bulk knitting materials.",
    "average_price": "Short group classes tend to sit in the tens to low hundreds of pounds depending on length, while bespoke embroidery work is quoted individually based on design and scale.",
    "been": "NO",
    "approved": "NO",
    "overall": "Knit/Embroidery"
  },
  {
    "name": "Sharp Works Yarn & Haberdashery",
    "id": "sharp_works_yarn_haberdashery",
    "address": "220 Railton Rd, London SE24 0JT",
    "category": "Knit/Embroidery",
    "phone": "020 7738 7668",
    "website": "http://www.sharpworks.co.uk/",
    "opening_hours": "Monday\tClosed\nTuesday\t10 am–5 pm\nWednesday\t10 am–5 pm\nThursday\t10 am–5 pm\nFriday\t10 am–5 pm\nSaturday\t10 am–5 pm\nSunday\tClosed",
    "pop_up": "Sharp Works is a yarn and haberdashery shop offering a wide range of knitting and crochet yarns, haberdashery accessories and classes.",
    "tags": [
      "Yarn",
      "Knitting",
      "Crochet",
      "Haberdashery",
      "Classes",
      "Natural-fibre",
      "Hobby-friendly"
    ],
    "more_info": "Located in Herne Hill, the shop is family-run and offers natural fibre yarns, knitting and crochet tools, and workshops for learners and hobbyists. \nIt is very relevant for knitters and embroidery hobbyists seeking quality yarns and craft support rather than large-scale production stock.",
    "average_price": "Most standard yarns sit in the usual hand-knitting range, with balls and skeins typically in the mid single digits, while luxury fibres and larger quantities cost more. Class prices are generally in the tens of pounds depending on duration.",
    "been": "NO",
    "approved": "NO",
    "overall": "Knit/Embroidery"
  },
  {
    "name": "F Ciment Pleating",
    "id": "f_ciment_pleating",
    "address": "18A Station Cl, Potters Bar EN6 1TL",
    "category": "Services",
    "phone": "01707 661311",
    "website": "http://www.cimentpleating.com/",
    "opening_hours": "Monday\t7:30 am–4 pm\nTuesday\t7:30 am–4 pm\nWednesday\t7:30 am–4 pm\nThursday\t7:30 am–4 pm\nFriday\t7:30 am–4 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "F Ciment Pleating specialises in fabric pleating services, producing standard and fancy pleat finishes for fashion and interiors.",
    "lat": 51.69997,
    "lng": -0.19478,
    "tags": [
      "Pleating",
      "Specialist Finish",
      "Production Service",
      "Fancy Pleats",
      "Textiles Processing"
    ],
    "more_info": "Established in 1925, this pleating house handles both machine and hand pleating for fabrics supplied by the customer, offering finishes such as box pleats, honeycomb, crushed and specialty patterns. It's used by designers, theatre costumiers and interior textile makers when a pleated effect is needed rather than plain cloth. Their process includes fabric submission, pleat finishing and often post-pleat",
    "average_price": "DOIBLE CHECK PER METER - As a guide, some pleat panels are listed at around £23–£33 per panel (plus VAT) for standard patterns.",
    "been": "NO",
    "approved": "NO"
  },
  {
    "name": "The London Leather Workshop",
    "id": "the_london_leather_workshop",
    "address": "Unit 7, Thames-Side Studios, 002-003 Harrington Way, Warspite Rd, London SE18 5AU",
    "category": "Services",
    "phone": "07428 374902",
    "website": "https://www.thelondonleatherworkshop.com/",
    "opening_hours": "Monday\t9 am–6 pm\nTuesday\t9 am–6 pm\nWednesday\t9 am–6 pm\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "The London Leather Workshop offers design, sampling, small run manufacturing and craft training for leather goods, accessories and soft furnishings.",
    "lat": 51.49438,
    "lng": 0.04394,
    "tags": [
      "Leather-craft",
      "Accessory Design",
      "Sampling",
      "Small-run Manufacturing",
      "Training",
      "Leather Hides"
    ],
    "more_info": "Founded by experienced designers, this studio-workshop supports start-ups and small brands through the full process of accessory development — from sketching and tech-packs through prototype sampling and small production runs. It runs group and one-to-one courses in bag-making, leather sewing, pattern making and finishing, and sells leather hides and craft materials alongside. It bridges supply, education and production in leathercraft.",
    "average_price": "Workshops start from around £21–£25 per hour for group courses, and sample or bespoke manufacturing is quoted individually.",
    "been": "NO",
    "approved": "NO"
  },
  {
    "name": "goldhawk road",
    "id": "goldhawk_road",
    "address": "13 Goldhawk Road, Hammersmith and Fulham, London, W12 8QQ, United Kingdom",
    "category": "Markets",
    "pop_up": "Goldhawk Road is one of London's best-known fabric streets, with many independent shops offering a wide mix of fabrics at accessible prices.",
    "lat": 51.50292,
    "lng": -0.22375,
    "tags": [
      "Fabric Area",
      "Wide Range",
      "Value",
      "Mixed Stock",
      "Student Friendly",
      "Multiple Shops"
    ],
    "more_info": "This stretch of shops is popular with students, home-sewers and designers who want choice and value. You'll find cottons, silks, wools, jerseys, upholstery cloth, end-of-roll stock and occasional deadstock from manufacturers. The area is practical and fast-moving, with each shop specialising slightly differently, so browsing several is normal.",
    "average_price": "Shops often list cottons and basics in the lower price bands, with silks and specialty cloths higher depending on the shop. Many stores offer reduced rolls or end-of-line pricing.",
    "been": "NO",
    "approved": "NO"
  },
  {
    "name": "queens road market",
    "id": "queens_road_market",
    "address": "Green Street, Newham, London, E13 9AU, United Kingdom",
    "category": "Markets",
    "website": "https://www.newham.gov.uk/community-parks-leisure/newham-markets/3?documentId=17&categoryId=20009",
    "opening_hours": "Monday\tClosed\nTuesday\t9 am–6 pm\nWednesday\tClosed\nThursday\t9 am–6 pm\nFriday\t9 am–6 pm\nSaturday\t9 am–6 pm\nSunday\tClosed",
    "pop_up": "Queen's Road Market includes stalls and shops selling affordable fabrics, trims and household textiles. It is used by locals and makers who want lower-priced basics.",
    "lat": 51.53817,
    "lng": 0.0337,
    "tags": [
      "Fabric Market",
      "Value",
      "Everyday Cloth",
      "Prints",
      "Jersey",
      "Local Traders"
    ],
    "more_info": "The market has several fabric traders offering printed cottons, jerseys, net fabrics, lace, simple tailoring cloths and some haberdashery. Stock rotates frequently, and the area suits quick browsing for everyday materials rather than high-end or specialist fabrics.",
    "average_price": "Most fabrics sit in the low-cost band compared with central-London shops, with lightweight cottons and printed cloth often priced competitively.",
    "been": "NO",
    "approved": "NO"
  },
  {
    "name": "Walthamstow Market",
    "id": "walthamstow_market",
    "address": "High Street, Waltham Forest, London, E17 7LD, United Kingdom",
    "category": "Markets",
    "website": "https://www.walthamforest.gov.uk/libraries-arts-parks-and-leisure/local-markets/walthamstow-market",
    "opening_hours": "Monday\tClosed\nTuesday\t8 am–5 pm\nWednesday\t8 am–5 pm\nThursday\t8 am–5 pm\nFriday\t8 am–5 pm\nSaturday\t8 am–5:30 pm\nSunday\t Closed",
    "pop_up": "Walthamstow Market and the surrounding shops form a busy fabric area with multiple low- to mid-priced fabric stores and haberdasheries.",
    "lat": 51.58327,
    "lng": -0.02674,
    "tags": [
      "Fabric Area",
      "Value",
      "Wide Range",
      "Prints",
      "Haberdashery",
      "Local Shops"
    ],
    "more_info": "Known for long rows of shops selling cottons, jerseys, linings, sequins, trims and some outerwear fabrics, Walthamstow has become a regular stop for hobby-sewers and small makers. Reviewers mention the approachable pricing, the range suitable for everyday sewing, and the convenience of several shops in close walking distance.",
    "average_price": "Lightweight cottons, jerseys and linings are usually at the affordable end, with occasional bargains on bulk or clearance rolls.",
    "been": "NO",
    "approved": "NO"
  },
  
  {
    "name": "The Alteration Yard London",
    "id": "The_Alteration_Yard_London",
    "address": "Workspace 154, 160 Fleet St, London EC4A 2DQ",
    "category": "Services",
    "phone": "020 7871 3116",
    "website": "https://www.alterationyard.co.uk",
    "opening_hours": "Monday\t9:30am6pm\nTuesday\t9:30am6pm\nWednesday  closed\n\nThursday\t9:30am6pm\nFriday\t9:30am6pm\nSaturday\t123pm\nSunday\tClosed",
    "pop_up": "Established in 2014, The Alteration Yard offers tailoring and alteration services across multiple locations, including specialist bridal alterations at selected stores.",
    "lat": 51.51421,
    "lng": -0.10745,
    "tags": [
      "Alterations",
      "Tailoring",
      "Repairs",
      "Bridal alterations",
      "Formalwear",
      "Seamstress services",
      "Walk-in accepted",
      "Private fittings",
      "After-hours service"
    ],
    "more_info": "Founded in 2014, The Alteration Yard provides professional tailoring and alteration services across Surrey and surrounding regions. Services range from everyday garment alterations to specialist bridal work.\nStores offer spacious fitting rooms and accept walk in fittings during opening hours. Selected locations include separate bridal fitting spaces for added privacy, with after hours services available for bridal alterations.",
    "average_price": "null",
    "been": "NO",
    "approved": "NO",
    "overall": "Services"
  },
  {
    "name": "Golden tailoring & alterations",
    "id": "Golden_tailoring_ alterations",
    "address": "Second floor, 59 Brewer St, London W1F 9UN",
    "category": "Services",
    "phone": "07944 601228",
    "website": "http://goldentailoring.co.uk",
    "opening_hours": "Monday\t11am6:30pm\nTuesday\t11am6:30pm\nWednesday\n\n11am6:30pm\nThursday\t11am6:30pm\nFriday\t11am6:30pm\nSaturday\t11am6:30pm\nSunday\tClosed",
    "pop_up": "Golden Tailoring and Alterations offers tailoring and alteration services for mens and womens garments, with experience across a wide range of fabrics, including leather and silk.",
    "lat": 51.51142,
    "lng": -0.13549,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Seamstress",
      "services",
      "Leather work",
      "Silk handling",
      "Beading"
    ],
    "more_info": "Based in central London, Golden Tailoring and Alterations provides tailoring and alteration services for both mens and womens clothing. The studio has experience working with a variety of fabric types, including leather, silk, and garments involving beading or detailed finishes.\nThe team consists of fit consultants, seamstresses, and tailors with backgrounds in bespoke tailoring, offering services ranging from standard alterations to more specialised adjustments.",
    "average_price": "null",
    "been": "NO",
    "approved": "NO",
    "overall": "Services"
  },
  {
    "name": "Alterations Couture",
    "id": "Alterations_Couture",
    "address": "First Floor, 72 Wells St, London W1T 3QF",
    "category": "Services",
    "phone": "020 7287 1833",
    "website": "https://www.alterationsboutique.co.uk/marylebone",
    "opening_hours": "Monday\tClosed\nTuesday\t9am6pm\nWednesday\n\nClosed\n \nThursday\t9am6pm\nFriday\t9am5pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Alterations Couture specialises in high-end garment alterations, focusing on designer and luxury pieces, including structured tailoring and delicate garments.",
    "lat": 51.51703,
    "lng": -0.13787,
    "tags": [
      "Tailoring",
      "Luxury garments",
      "Designer wear",
      "Formalwear",
      "Eveningwear",
      "Structured tailoring",
      "Silk handling",
      "Private fittings"
    ],
    "more_info": "Located in Fitzrovia, Alterations Couture provides alteration services for luxury and designer garments. The studio focuses exclusively on alterations rather than made-to-measure or bespoke production.\nWork includes adjustments to tailored suits, eveningwear, and couture-level garments, with experience handling delicate fabrics and detailed construction. The team includes a Savile Rowtrained tailor alongside experienced seamstresses, offering fitting-led alteration services in a private studio setting.",
    "average_price": "null",
    "been": "NO",
    "approved": "NO",
    "overall": "Services"
  },
  {
    "name": "Alterations Boutique, Chelsea",
    "id": "Alterations_Boutique_Chelsea",
    "address": "33 Elystan St, London SW3 3NT",
    "category": "Services",
    "phone": "020 7724 4147",
    "website": "https://www.alterationsboutique.co.uk/chelsea",
    "opening_hours": "Monday\tClosed\nTuesday\t9:30am6:30pm\nWednesday\n\n9:30am6pm\n \nThursday\t9:30am6:30pm\nFriday\t9:30am6:30pm\nSaturday\t9:30am6:30pm\nSunday\tClosed",
    "pop_up": "Alterations Boutique provides tailoring and alteration services across multiple locations, including specialist bridal alterations.",
    "lat": 51.49136,
    "lng": -0.16744,
    "tags": [
      "Alterations",
      "Tailoring",
      "Repairs",
      "Bridal alterations",
      "Formalwear",
      "Seamstress services",
      "Walk-in accepted",
      "Private fittings",
      "After-hours service"
    ],
    "more_info": "Alterations Boutique offers professional tailoring and alteration services through several branches. Services include everyday garment alterations as well as specialist bridal work.\nLocations provide fitting rooms and accept walk-in fittings during opening hours. Selected branches offer separate bridal fitting spaces and after-hours services for bridal alterations.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Alterations Boutique, Hampstead",
    "id": "Alterations_Boutique_Hampstead",
    "address": "62 Rosslyn Hill, London NW3 1ND",
    "category": "Services",
    "phone": "020 7724 4147",
    "website": "https://www.alterationsboutique.co.uk/hampstead",
    "opening_hours": "Monday\tClosed\nTuesday\t9:30am6:30pm\nWednesday\n\n9:30am6pm\nThursday\t9:30am6:30pm\nFriday\t9:30am6:30pm\nSaturday\t9:30am6:30pm\nSunday\tClosed",
    "pop_up": "Alterations Boutique provides tailoring and alteration services across multiple locations, including specialist bridal alterations.",
    "lat": 51.55522,
    "lng": -0.17366,
    "tags": [
      "\"Alterations",
      "Tailoring",
      "Repairs",
      "Bridal alterations",
      "Formalwear",
      "Seamstress services",
      "Walk-in accepted",
      "Private fittings",
      "After-hours service",
      "\""
    ],
    "more_info": "Alterations Boutique offers professional tailoring and alteration services through several branches. Services include everyday garment alterations as well as specialist bridal work.\nLocations provide fitting rooms and accept walk-in fittings during opening hours. Selected branches offer separate bridal fitting spaces and after-hours services for bridal alterations.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Alterations Boutique, Wimbledon",
    "id": "Alterations_Boutique_Wimbledon",
    "address": "34 High St, London SW19 5BY",
    "category": "Services",
    "phone": "020 7724 4147",
    "website": "https://www.alterationsboutique.co.uk/wimbledon",
    "opening_hours": "Monday\tClosed\nTuesday\t9:30am6:30pm\nWednesday\n\n9:30am6pm\n \nThursday\t9:30am6:30pm\nFriday\t9:30am6:30pm\nSaturday\t9:30am6:30pm\nSunday\tClosed",
    "pop_up": "Alterations Boutique provides tailoring and alteration services across multiple locations, including specialist bridal alterations.",
    "lat": 51.42529,
    "lng": -0.21938,
    "tags": [
      "Alterations",
      "Tailoring",
      "Repairs",
      "Bridal alterations",
      "Formalwear",
      "Seamstress services",
      "Walk-in accepted",
      "Private fittings",
      "After-hours service"
    ],
    "more_info": "Alterations Boutique offers professional tailoring and alteration services through several branches. Services include everyday garment alterations as well as specialist bridal work.\nLocations provide fitting rooms and accept walk-in fittings during opening hours. Selected branches offer separate bridal fitting spaces and after-hours services for bridal alterations.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Haute Tailoring",
    "id": "Haute_Tailoring",
    "address": "204 Kensington Park Rd, London W11 1NR",
    "category": "Services",
    "phone": "07760 228202",
    "website": "https://www.hautetailoring.co.uk",
    "opening_hours": "Monday\t9am7pm\nTuesday\t9am7pm\nWednesday\n\n9am7pm \nThursday\t9am7pm\nFriday\t9am7pm\nSaturday\t10am6pm\nSunday\tClosed",
    "pop_up": "Haute Tailoring provides bespoke and alteration services for garments including formalwear, weddings, and made-to-measure pieces.",
    "lat": 51.5161,
    "lng": -0.20595,
    "tags": [
      "Alterations",
      "Tailoring",
      "Bespoke tailoring",
      "Made-to-measure",
      "Menswear",
      "Womenswear",
      "Wedding dress alterations",
      "Formalwear",
      "Dressmaking",
      "Repairs",
      "Private fittings",
      "Silk handling",
      "Walk-in accepted"
    ],
    "more_info": "Haute Tailoring is a tailoring and alteration service based on Kensington Park Road in London. The studio offers a range of services including alterations and repairs for menswear and ladieswear, bespoke and made-to-measure tailoring, dressmaking, wedding dress alterations, and restyling. Services include simple adjustments such as hemline and neckline alterations as well as more detailed work on couture and formal garments. The business operates by appointment and during listed opening hours",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Alterations Bespoke, Altbes",
    "id": "Alterations_Bespoke_Altbes",
    "address": "44 Moreton St, Pimlico, London SW1V 2PB",
    "category": "Services",
    "phone": "07985 575350",
    "website": "https://www.alterationsandbespoke.com",
    "opening_hours": "Monday\t9am7pm\nTuesday\t9am7pm\nWednesday\n\n9am7pm\n \nThursday\t9am7pm\nFriday\t9am7pm\nSaturday\t126pm\nSunday\t125pm",
    "pop_up": "Altbes offers tailoring, alterations, and bespoke garment services for menswear and womenswear, including repairs and custom work.",
    "lat": 51.48896,
    "lng": -0.13713,
    "tags": [
      "Alterations",
      "Tailoring",
      "Bespoke tailoring",
      "Menswear",
      "Womenswear",
      "Custom design",
      "Leather work",
      "Fur repair",
      "Hand beading",
      "Embroidery",
      "Wedding alterations",
      "Soft furnishings",
      "Repairs",
      "Walk-in accepted",
      "Collection and delivery",
      "Home fittings",
      "Expedited service"
    ],
    "more_info": "Alterations & Bespoke (Altbes) is a tailoring and garment service based in Pimlico, London. The atelier provides alterations and repairs for mens, womens, and childrens clothing, bespoke tailoring, custom design services, and garment copying. Services extend to specialist work such as fur and leather repair, soft furnishings, hand embroidery and beading, and occasion-wear adjustments. Expedited, collection and delivery, and home or hotel fitting services are also available. Walk-ins are welcome, and fittings can be scheduled during opening hours",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Orhan London Tailoring",
    "id": "Orhan_London_Tailor",
    "address": "25A PITFIELD STREET, LONDON, N1 6HB",
    "category": "Services",
    "phone": "020 7250 3569",
    "website": "https://www.orhanlondontailoring.com",
    "opening_hours": "Sunday\tClosed\nMonday\tClosed\nTuesday\tClosed\nWednesday\n\nClosed\n \nThursday\t9am6pm\nFriday\t9am6pm\nSaturday\t10am2pm",
    "pop_up": "Orhan London Tailoring provides bespoke tailoring for menswear and womenswear, with a focus on made-to-measure garments and individual fittings.",
    "lat": 51.52711,
    "lng": -0.08386,
    "tags": [
      "Bespoke tailoring",
      "Made-to-measure",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Custom garments",
      "Private fittings",
      "Inclusive tailoring"
    ],
    "more_info": "Founded in 2007, Orhan London Tailoring is a family-run tailoring studio based in Shoreditch. The studio offers bespoke and made-to-measure tailoring services for both menswear and womenswear.\nThe master tailor has a background in womenswear and has previously worked with high-profile clients, with the studio now providing a balanced range of services across genders. Orhan London Tailoring positions inclusivity at the core of its practice and works with clients across a wide range of styles, body types, and identities. Fittings are conducted in a studio setting, with garments developed around individual preferences and requirements.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "A&K Tailoring",
    "id": "A_K_Tailoring",
    "address": "19A Mare St, London E8 4RP",
    "category": "Services",
    "phone": "020 3518 9641",
    "website": "https://www.aktailoring.co.uk",
    "opening_hours": "Monday\t8am7pm\nTuesday\t8am7pm\nWednesday\n\n8am7pm\nThursday\t8am7pm\nFriday\t8am7pm\nSaturday\t8am7pm\nSunday\tClosed",
    "pop_up": "A&K Tailoring offers tailoring, alterations, and made-to-measure services for menswear and womenswear in East London.",
    "lat": 51.53484,
    "lng": -0.05749,
    "tags": [
      "Alterations",
      "Tailoring",
      "Made-to-measure",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Wedding alterations",
      "Repairs",
      "Custom garments",
      "Walk-in accepted",
      "Private fittings",
      "Outerwear"
    ],
    "more_info": "A&K Tailoring is a tailoring and alterations service based on Mare Street in Hackney, London. The studio provides garment alterations, repairs, and made-to-measure tailoring for both mens and womens clothing, including outerwear and formal pieces. A&K Tailoring also works with wedding outfits and bespoke garments. Services are available by appointment and during opening hours, with a range of standard tailoring adjustments and custom fitting options",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "No One Famous Tailoring",
    "id": "No_One_Famous_Tailoring",
    "address": "258 High Rd. Leyton, London E10 5PW",
    "category": "Services",
    "phone": "07956 126314",
    "website": "https://www.noonefamoustailoring.co.uk/#home",
    "opening_hours": "Monday\t11am7pm\nTuesday\t11am7pm\nWednesday\n\nClosed\n \nThursday\t11am7pm\nFriday\t11am7pm\nSaturday\t11am7pm\nSunday\tClosed",
    "pop_up": "No One Famous Tailoring provides tailoring, alterations, and custom garment services for menswear and womenswear from its Leyton location.",
    "lat": null,
    "lng": -0.00779,
    "tags": [
      "Alterations",
      "Tailoring",
      "Bespoke tailoring",
      "Menswear",
      "Womenswear",
      "Repairs",
      "Custom garments",
      "Walk-in accepted",
      "Formalwear",
      "Jeans alterations",
      "Quick turnaround",
      "Private fittings"
    ],
    "more_info": "No One Famous Tailoring is a tailoring and alterations service based on High Road in Leyton, East London. The studio offers a range of services including clothing alterations, repairs, bespoke tailoring, and custom design work for both mens and womens garments. Services include adjustments to everyday clothing such as jeans and jackets as well as formal and occasion wear; specific pricing examples include adjustments, tapering, and zip replacements. Initial consultations are offered, and fittings are available during opening hours.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Carmen's Tailoring Studio",
    "id": "Carmens_Tailoring_Studio",
    "address": "first floor, 15 New Row, London WC2N 4LD",
    "category": "Services",
    "phone": "020 8076 7098",
    "website": "https://www.carmenstailoring.co.uk",
    "opening_hours": "Monday\tClosed\nTuesday\t10am6pm\nWednesday\n\nClosed\n \nThursday\t10am6pm\nFriday\t10am5pm\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "Carmens Tailoring Studio focuses on everyday garment alterations and fitting adjustments, working across menswear, womenswear, and occasion wear.",
    "lat": 51.51122,
    "lng": -0.12564,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Repairs",
      "Occasion wear",
      "Hemming",
      "Private fittings",
      "Walk-in accepted"
    ],
    "more_info": "Carmens Tailoring Studio is a tailoring and alteration service located in London. The studio offers clothing alterations, repairs, and fitting services for both mens and womens garments. Work includes adjustments such as hemming, resizing, and garment repairs, as well as tailoring for formal and everyday clothing. Appointments and fittings are available during opening hours, and walk-ins may be accepted depending on availability.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "LQ Tailoring Soho",
    "id": "LQ_Tailoring_SOHO",
    "address": "36 Glasshouse St, London W1B 5DL",
    "category": "Services",
    "phone": "020 3489 6490",
    "website": "https://lqtailoring.co.uk",
    "opening_hours": "Monday\t10am7pm\nTuesday\t10am7pm\nWednesday\n\n10am7pm\n \nThursday\t10am7pm\nFriday\t10am7pm\nSaturday\t10am7pm\nSunday\t11am6pm",
    "pop_up": "London Quality Tailoring offers garment alterations and tailoring services for a wide range of clothing, with options for studio, home, and workplace fittings.",
    "lat": 51.51038,
    "lng": -0.13815,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Evening wear",
      "Repairs",
      "Home fittings",
      "Workplace fittings",
      "Collection and delivery",
      "Shirt alterations",
      "Trouser alterations"
    ],
    "more_info": "London Quality Tailoring provides tailoring and alteration services for menswear and womenswear, covering garments such as shirts, jackets, coats, dresses, skirts, blouses, and trousers. Services include adjustments to everyday clothing as well as evening and formalwear.\nThe business offers fittings at its studio as well as on-site consultations at home or workplaces. London Quality Tailoring also provides collection and delivery services across London and surrounding areas. The team has experience working with a range of fabric types and offers fitting guidance during appointments to help determine suitable alterations.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Thames Tailoring",
    "id": "Thames_Tailoring",
    "address": "255 Old Kent Rd, London SE1 5LU",
    "category": "Services",
    "phone": "07944 402 203",
    "website": "https://thamestailoring.com",
    "opening_hours": "Monday\t9am8pm\nTuesday\t9am8pm\nWednesday\n\n9am8pm \nThursday\t9am8pm\nFriday\t9am8pm\nSaturday\t10am7pm\nSunday\tClosed",
    "pop_up": "Thames Tailoring provides tailoring and alteration services with a focus on made-to-measure and custom fittings for both menswear and womenswear.",
    "lat": 51.48968,
    "lng": -0.07896,
    "tags": [
      "Alterations",
      "Tailoring",
      "Bespoke tailoring",
      "Made-to-measure",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Custom garments",
      "Private fittings",
      "Walk-in accepted"
    ],
    "more_info": "Thames Tailoring is a tailoring and alterations service based in London. The studio offers garment alterations, bespoke and made-to-measure tailoring, and fitting-led adjustments for both mens and womens clothing. Services include adjustments to everyday garments as well as formal and occasion wear. Appointments and fittings are available during opening hours, with consultations focused on achieving a tailored fit based on individual measurements and preferences.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "The Garment Studio",
    "id": "The_Garment_Studio",
    "address": "Studio A4M, Park & 4th Floor, Bussey Building, Red Stairs, 133 Rye Lane - Copeland, London SE15 4ST",
    "category": "Services",
    "phone": "07360 546321",
    "website": "thegarmentstudio.co.uk",
    "opening_hours": "Monday\t10am3pm\nTuesday\t10am3pm\nWednesday\n\nClosed\ns: \nThursday\t10am3pm\nFriday\tClosed\nSaturday\tClosed\nSunday\tClosed",
    "pop_up": "The Garment Studio works across garment alterations and construction-led adjustments, supporting both everyday clothing and more complex fitted pieces.",
    "lat": 51.472,
    "lng": -0.06968,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Occasion wear",
      "Repairs",
      "Fit adjustments",
      "Seamstress services",
      "Private fittings"
    ],
    "more_info": "The Garment Studio provides tailoring and alteration services for menswear and womenswear, including repairs and fit adjustments across a range of garment types. The studio undertakes work on casual, formal, and occasion wear, with fittings used to assess proportion, balance, and construction before alterations are carried out. Services are available during opening hours, with fittings offered on site.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Francesco Tailor",
    "id": "Francesco_Tailor",
    "address": "46 Berwick St, London W1F 8SG",
    "category": "Services",
    "phone": "07380 800023",
    "website": null,
    "opening_hours": "Monday\t10am7pm\nTuesday\t10am7pm\nWednesday\n\n10am7pm\n \nThursday\t10am7pm\nFriday\t10am7pm\nSaturday\t10am7pm\nSunday\tClosed",
    "pop_up": "Francesco Tailor offers tailoring and alteration services with a focus on fitted menswear and formal garments.",
    "lat": 51.51524,
    "lng": -0.13613,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Formalwear",
      "Suit alterations",
      "Trouser alterations",
      "Repairs",
      "Structured tailoring",
      "Private fittings"
    ],
    "more_info": "Francesco Tailor is a tailoring and alterations service providing fit adjustments, repairs, and custom tailoring for menswear, with selected services available for womenswear. Work includes alterations to suits, jackets, trousers, and formal clothing, with fittings used to assess proportion and structure before alterations are carried out. Services are available during opening hours, with in-studio fittings offered.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Exclusive Alterations",
    "id": "Exclusive_Alterations",
    "address": "Studio 144, Business Design Centre, 52 Upper St, London N1 0PW",
    "category": "Services",
    "phone": "020 3991 0418",
    "website": "https://exclusivealterations.co.uk",
    "opening_hours": "Monday\tClosed\nTuesday\tClosed\nWednesday\n\nClosed\n \nThursday\t10am7pm\nFriday\t10am7pm\nSaturday\t10am6pm\nSunday\tClosed",
    "pop_up": "Exclusive Alterations focuses on garment alterations and fit adjustments for formalwear, occasion wear, and everyday clothing.",
    "lat": 51.53551,
    "lng": -0.10532,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Occasion wear",
      "Repairs",
      "Fit adjustments",
      "Seamstress services",
      "Private fittings"
    ],
    "more_info": "Exclusive Alterations provides tailoring and alteration services for menswear and womenswear, including adjustments to suits, dresses, outerwear, and occasion garments. Services cover common alterations such as hemming, resizing, and repairs, with fittings used to assess fit and proportion before work is carried out. Alterations are offered during opening hours, with in-studio fittings available.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Plummer's Tailoring",
    "id": "Plummers_Tailoring",
    "address": "7 Henrietta St, London WC2E 8PS",
    "category": "Services",
    "phone": "020 3829 3483",
    "website": null,
    "opening_hours": "Monday\t11am6pm\nTuesday\t11am6pm\nWednesday\n\n11am6pm \nThursday\t11am6pm\nFriday\t11am6pm\nSaturday\t11am6pm\nSunday\t125pm",
    "pop_up": "Plummers Tailoring combines traditional tailoring techniques with practical garment alterations, working across everyday clothing and formal pieces",
    "lat": 51.51104,
    "lng": -0.12323,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Outerwear",
      "Repairs",
      "Fit adjustments",
      "Structured tailoring",
      "Private fittings"
    ],
    "more_info": "Plummers Tailoring provides tailoring and alteration services for menswear and womenswear, including repairs and fit adjustments for suits, jackets, trousers, and outerwear. The studio undertakes both routine alterations and more involved tailoring work, with fittings used to assess balance and proportion. Services are available during opening hours, with in-store fittings offered.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "R.A Tailoring",
    "id": "R_A_Tailoring",
    "address": "59 Shelton St, London WC2H 9HE",
    "category": "Services",
    "phone": "07869 863160",
    "website": "http://www.rezaamiribespoke.co.uk/",
    "opening_hours": "Monday\t9am8pm\nTuesday\t9am8pm\nWednesday\n\n9am12am \nThursday\t126:30am, 9am8pm\nFriday\t9am8pm\nSaturday\t9am8pm\nSunday\tClosed",
    "pop_up": "R.A Tailoring offers garment alterations and tailoring services with a practical focus on fit corrections and everyday wear.",
    "lat": 51.51462,
    "lng": -0.12396,
    "tags": [
      "Alterations",
      "Tailoring",
      "Menswear",
      "Womenswear",
      "Formalwear",
      "Everyday alterations",
      "Repairs",
      "Hemming",
      "Fit adjustments",
      "Private fittings"
    ],
    "more_info": "R.A Tailoring provides tailoring and alteration services for menswear and womenswear, including common adjustments such as hemming, resizing, and repairs. Work covers everyday garments as well as formal clothing, with fittings used to assess fit and proportion before alterations are carried out. Services are available during opening hours, with in-studio fittings offered.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Forest Digital ",
    "id": "Forest_digital",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://forestdigital.co.uk",
    "opening_hours": null,
    "pop_up": "Forest Digital is a textile printing and production service specialising in digital fabric printing, sampling and small-run manufacturing",
    "lat": null,
    "lng": null,
    "tags": [
      "Digital printing",
      "Textile printing",
      "Fabric printing",
      "Custom prints",
      "Production services",
      "Garment development",
      "Online service"
    ],
    "more_info": "Operating from the UK, this service provider works with designers, brands and studios to print custom artwork onto fabric bases, handle small-batch manufacturing of scarves, home-ware, apparel and accessories. They emphasise high-quality inks, a wide variety of fabric bases (including silks and natural fibres), and flexibility for short runs or custom projects.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
    {
    "name": "The Button Queen ",
    "id": "The_button_queen",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "http://www.thebuttonqueen.co.uk/",
    "opening_hours": null,
    "pop_up": "The Button Queen is a specialist shop entirely devoted to buttonsfrom tailoring sizes and horn buttons to vintage and decorative pieces. The focus is distinct and dedicated.",
    "lat": null,
    "lng": null,
    "tags": [
      "Buttons",
      "Haberdashery",
      "Vintage buttons",
      "Contemporary buttons",
      "Decorative fastenings",
      "Garment construction",
      "Production stock",
      "Online shop"
    ],
    "more_info": "Operating for decades, The Button Queen is recognised for its extensive collection spanning horn, shell, metal, blazer-sized and rare vintage buttons. Tailors, costume-makers and designers frequently praise the depth of selection and the ability to source rare or bespoke button styles. The service is specialist and button-centricif your garment hinges on its closure hardware, this is the go-to.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Linton Tweeds",
    "id": "Linton_tweeds",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://lintontweeds.com",
    "opening_hours": null,
    "pop_up": "Linton Tweeds offers couture-woven tweeds, boucls and fancy weaves online, focused on high-quality cloth rather than basic fabrics.",
    "lng": null,
    "tags": [
     "Fabric supplier",
     "Tweed",
     "Wool fabrics",
      "Heritage textiles",
      "Woven fabrics",
     "Luxury materials",
      "Production stock",
      "Online shop"
    ],
    "more_info": "Linton Tweeds has over a century of experience manufacturing fine woven tweeds and boucl fabrics, now selling collections online with worldwide delivery. Their fabrics appeal to designers, couture makers and interior specialists rather than hobby-sewers buying commodity cloth. Some sale listings show dramatic drops (e.g., tweeds reduced to ~20/m in end-of-line events).",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Barnett Lawson Trimmings",
    "id": "Barnett_Lawson_Trimmings",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://www.barnettlawson.co.uk/",
    "opening_hours": null,
    "pop_up": "Barnett Lawson is an online trimmings retailer offering a large catalogue of fringes, tassels, cords, braids and decorative pieces.",
    "lng": null,
    "tags": [
"Trimmings",
"Haberdashery",
"Buttons",
"Zips",
"Threads",
"Ribbons",
"Fastenings",
"Garment construction",
"Production stock",
"Online shop"
    ],
    "more_info": "With a long history in the trimming trade, Barnett Lawson now operates mainly online and is known for its classical and decorative trims used in costume, interiors, millinery and embellishment work. The catalogue includes items not often found in general haberdashery shops, and its popular with designers who need detailed or ornamental finishes.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Contour Atelier",
    "id": "Contour_Atelier",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://www.contouratelier.com",
    "opening_hours": null,
    "pop_up": "Contour Atelier is an online warehouse for luxury contour and lingerie fabrics and suppliesfrom lace and mesh to hardware and exclusive kits.",
    "lng": null,
    "tags": [
"Lingerie", 
"Contour", 
"Swimwear", 
"Lace", 
"Hardware", 
"Exclusive kits", 
"Online service", 
"Online Shop", 
"Luxury finish", 
"Contour design"
    ],
    "more_info": "This site offers fabrics and supplies tailored for lingerie, swimwear, finely made contemporary contour garments and accessories. Their catalog includes items like 24 K gold plated hardware, French lace, Swiss embroidery, powermesh, and fabrics priced from lower tiers (e.g., tulle from ~4) up to premium finishes. The business is oriented toward makers who work at a specialist level rather than casual sewers.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Bratastic Fabrics",
    "id": "Bratistic_Fabrics",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://www.bratasticfabrics.co.uk",
    "opening_hours": null,
    "pop_up": "Bratastic Fabrics is an online store focused on lingerie-making supplies, fabrics and kits rather than general dress textiles.",
    "lng": null,
    "tags": [
"Lingerie", 
"Bra-making", 
"Contour", 
"Kits", 
"Elastic", 
"Boning",
"Specialist Materials",
"Online shop"
    ],
    "more_info": "Bratastic serves makers of bras and intimate apparel with fabrics, elastics, pre-cut kits and instruction sessions; for example users mention dream lingerie supplies and supportive service for bra-making beginners. The shop only ships in the UK but has a strong niche appeal for anyone working in lingerie design or sewing.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Vena Cava",
    "id": "Vena_Cava",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://www.venacavadesign.co.uk",
    "opening_hours": null,
    "pop_up": "Vena Cava Design is an online supplier specialising in corsetry, tailoring fabrics and costume-making materials, rather than everyday dress fabrics.",
    "lng": null,
    "tags": [
"Corsetry", 
"Technical fabric", 
"Contour",
"Bra Making",
"Costume", 
"Boning", 
"Powernet", 
"Specialist stock", 
"Online shop"
    ],
    "more_info": "Operating since the late 1990s, Vena Cava Design serves home sewists, costume makers and specialist dressmakers with fabrics like coutil, duchess satin, powernet, boning and corset interlinings. Their range includes strong technical fabrics (for structure) alongside decorative finishes, and their stock often appeals to users working in niche or historical costume work. Customers value the specialist nature but note that browsing is online-centric rather than a bricks-and-mortar browsing experience.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Renee Materials",
    "id": "Rennee_Materials",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://reneematerials.co.uk",
    "opening_hours": null,
    "pop_up": "Rene Materials is a material reuse marketplace offering surplus fabrics, yarns, textiles and leather for makers, with a sustainability angle.",
    "lng": null,
    "tags": [
"Fabric supplier",
"Technical fabrics",
"Synthetic materials",
"Performance textiles",
"Specialist materials",
"Garment construction",
"Production stock",
"Online shop"
    ],
    "more_info": "Rene sources excess materials and off-cuts and makes them available to creatives and students, emphasising reuse and circular design. The offering includes yarn bundles, fabric off-cuts and material scrap for crafting, which makes it relevant for knitters, textile artists and embroidery-makers exploring experimental or budget-friendly materials.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
    "name": "Yeoman - Yarn",
    "id": "Yoeman_Yarn",
    "address": null,
    "category": "Online",
    "phone": null,
    "website": "https://www.yeoman-yarns.co.uk",
    "opening_hours": null,
    "pop_up": "Yeoman Yarns is an online shop selling hand-knitting and machine-knitting yarns, patterns and accessories.",
    "lng": null,
    "tags": [
"Yarn supplier",
"Natural fibres",
"Wool yarn",
"Cotton yarn",
"Silk yarn",
"Knitting yarn",
"Weaving yarn",
"Production stock",
"Online shop"
    ],
    "more_info": "The company offers a wide selection of yarns in different fibres and weights, including cotton, wool, acrylic blends and occasional luxury mixes. Users note that the site is practical for ordering larger cones or specific colours for home or small-scale making. The shop also provides shade cards and pattern options, which helps when planning projects or matching yarn types.",
    "average_price": null,
    "been": null,
    "approved": null,
    "overall": null
  },
  {
  "name": "Handweavers Studio",
  "id": "handWeavers_studio",
  "address": null,
  "category": "Online",
  "phone": "020 72 72 1891",
  "website": "https://www.handweavers.co.uk",
  "opening_hours": null,
  "pop_up": "Handweavers Studio is a specialist supplier of yarns, fibres and weaving materials, with tools and classes for makers working in textile craft.",
  "lng": null,
  "tags": [
    "Fabric supplier",
    "Handwoven fabrics",
    "Silk",
    "Cotton",
    "Wool",
    "Natural fibres",
    "Artisan textiles",
    "Production stock",
    "Online shop"
  ],
  "more_info": "The shop carries a broad range of fibres and yarns for weaving, spinning and felting, along with looms, tools and equipment. Customers mention that the stock includes both standard fibres and more unusual materials, and that the space supports those exploring weaving or textile craft in a hands-on way. The studio also runs courses for beginners and experienced makers, creating a steady mix of learning and practical supply in one place.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": "Knit/Embroidery"
},
{
  "name": "Kleins Haberdashery",
  "id": "kleins_haberdashery",
  "address": null,
  "category": "Online",
  "phone": null,
  "website": "https://kleinshaberdashery.co.uk",
  "opening_hours": null,
  "pop_up": "Kleins Haberdashery is an online haberdashery and trimmings supplier offering buttons, ribbons, zips and sewing accessories for hobbyists and makers.",
  "lng": null,
  "tags": [
    "Haberdashery",
    "Trimmings",
    "Buttons",
    "Zips",
    "Threads",
    "Elastic",
    "Sewing notions",
    "Garment construction",
    "Production stock",
    "Online shop"
  ],
  "more_info": "While detailed current information is not abundant, the retailer is known within online sewing communities as a go-to for trimmings and haberdashery items, giving makers access to accessories and small-quantity supplies alongside basic cloth.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "The Lining Company",
  "id": "the_lining_company",
  "address": null,
  "category": "Online",
  "phone": "01702 523315",
  "website": "https://www.theliningcompany.co.uk",
  "opening_hours": null,
  "pop_up": null,
  "lng": null,
  "tags": [
    "Linings",
    "Interlinings",
    "Cupro",
    "Viscose",
    "Polyester linings",
    "Garment construction",
    "Production stock",
    "Online shop"
  ],
  "more_info": null,
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": "Tailoring"
},
{
  "name": "Top Fabric",
  "id": "top_fabrics",
  "address": null,
  "category": "Online",
  "phone": null,
  "website": "https://www.topfabric.co.uk",
  "opening_hours": null,
  "pop_up": "Top Fabric is an online retailer offering a large catalogue of fabrics (over 20,000 styles) including dress-, suit- and home-textile cloths, with international shipping and student discounts.",
  "lng": null,
  "tags": [
    "Fabric supplier",
    "Cotton",
    "Silk",
    "Wool",
    "Linen",
    "Synthetic fabrics",
    "Dress fabrics",
    "Production stock",
    "Online shop"
  ],
  "more_info": "Top Fabric emphasises choice, stock and flexibility: customers can buy in 10 cm increments, request swatches, and make volume orders if needed. The site states it supports student discounts and international delivery. Their positioning is broad: makers, small brands, students and interior users.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "J Wood Leather",
  "id": "J_wood",
  "address": "West Yorkshire, UK",
  "category": "Online",
  "phone": null,
  "website": "https://www.jwoodleathers.co.uk",
  "opening_hours": null,
  "pop_up": "J Wood Leathers is a family-run leather merchant and wholesaler offering hides, skins and leathercraft materials online, suitable for makers and small-scale manufacturers.",
  "lng": null,
  "tags": [
    "Leather",
    "Leather hides",
    "Vegetable tanned leather",
    "Suede",
    "Garment leather",
    "Upholstery leather",
    "Natural materials",
    "Production stock",
    "Online shop"
  ],
  "more_info": "Based in West Yorkshire and supplying globally, J Wood provides a large selection of leather types including full grain sides, vegetable-tanned hides, metallic finishes, hair-on hides and upholstery leathers. The website notes that stock is fully supported and hides can be ordered online with delivery, making the company accessible for home makers, designers and smaller producers. Customers appreciate the breadth of choice and the availability of stock lots or special-offer sections for craft-friendly users.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "A & A Crack & Sons - Leather",
  "id": "a_a_crack_sons",
  "address": null,
  "category": "Online",
  "phone": null,
  "website": "https://www.aacrack.com",
  "opening_hours": null,
  "pop_up": "A & A Crack & Sons is a UK-based specialist leather supplier offering a wide range of hides, skins and associated materials for production, craft and luxury use.",
  "lng": null,
  "tags": [
    "Leather",
    "Leather hides",
    "Sheepskin",
    "Suede",
    "Garment leather",
    "Upholstery leather",
    "Natural materials",
    "Production stock",
    "Online shop"
  ],
  "more_info": "With over 35 years experience, A & A Crack supplies leather including vegetable-tanned, chrome-tanned, suedes, hair-on hides and embossed finishes. Their offering spans applications from bags, belts, footwear, upholstery and accessories. The company also provides services like splitting, embossing and colour-matching so users can tailor the leather to their project. Feedback notes the depth of stock, with both artisan-scale skins and production-volume panels available, and many makers value the combination of materials and services in one place.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "Lyon Leather",
  "id": "Lyon_leather",
  "address": null,
  "category": "Online",
  "phone": null,
  "website": "https://lyonleathers.co.uk",
  "opening_hours": null,
  "pop_up": "Lyon Leathers is an online and factory-based supplier of leather hides, skins and related hardware, catering to makers, shoemakers, bag-makers and production use.",
  "lng": null,
  "tags": [
    "Leather",
    "Leather hides",
    "Suede",
    "Shearling",
    "Upholstery leather",
    "Garment leather",
    "Natural materials",
    "Production stock",
    "Online shop"
  ],
  "more_info": "Established in 1990 and family-run, Lyon Leathers supplies a wide stock of leather hides (vegetable-tanned, chrome-tanned), hair-on hides, suedes, and associated hardware such as buckles, rivets and straps. They serve belt, bag, accessory, leather-goods production as well as individual crafters, and information shows hidden stock types and pricing across website categories.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "SOJO",
  "id": "SOJO",
  "address": null,
  "category": "Online",
  "phone": null,
  "website": null,
  "opening_hours": null,
  "pop_up": "SOJO is a clothing repairs and tailoring platform that offers alterations and repair services via online booking, with options for collection and delivery across London.",
  "lng": null,
  "tags": [
    "Alterations",
    "Tailoring",
    "Repairs",
    "Delivery service",
    "App booking",
    "Collection & delivery",
    "Formalwear",
    "Casual alterations",
    "Private fittings",
    "Online service",
    "Walk-in accepted"
  ],
  "more_info": "SOJO is a fashion-tech platform offering alterations and clothing repairs through an online or app-based booking system. Customers can request tailoring or repair services via the SOJO website or app; garments are collected from the customers address or dropped off at a designated location and then returned after work is completed, typically within a week. SOJO also operates physical service points, including a concession at Selfridges in London, where fittings and consultations can be booked. The platform works with an in-house team of tailors for a range of alterations and repairs on everyday and formal garments.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "Zerow",
  "id": "Zerow_It",
  "address": "Scandicci (Florence), Italy",
  "category": "Online",
  "phone": null,
  "website": "https://www.zerow.it",
  "opening_hours": null,
  "pop_up": "Zerow is an online fabric shop specialising in deadstock and surplus textiles sourced from fashion and interior industries.",
  "lng": null,
  "tags": [
    "Fabric supplier",
    "Leather",
    "Deadstock fabrics",
    "Surplus textiles",
    "Sustainable sourcing",
    "Fashion fabrics",
    "Interior fabrics",
    "Limited quantities",
    "Production stock",
    "Online shop"
  ],
  "more_info": "Zerow is an online fabric and leather supplier based in Scandicci (Florence), Italy. The company selects and sells high-quality deadstock fabrics and leathers recovered from the stocks of Italian and international luxury fashion brands. Zerows range includes fashion and accessory textiles offered in limited quantities due to their reclaimed nature. The business also operates a showroom and atelier space in Scandicci where designers and artisans can explore materials and circular fashion concepts.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "Knopf Budke",
  "id": "Knopf_Budke",
  "address": "Germany",
  "category": "Online",
  "phone": null,
  "website": null,
  "opening_hours": null,
  "pop_up": "Knopf Budke is a specialist button supplier offering a wide range of buttons for garment production and repair.",
  "lng": null,
  "tags": [
    "Buttons",
    "Haberdashery",
    "Garment fastenings",
    "Decorative buttons",
    "Functional buttons",
    "Garment construction",
    "Production stock",
    "Online shop"
  ],
  "more_info": "Knopf Budke is a specialist button supplier based in Germany, operating primarily as an online retailer. The company supplies buttons and garment fastenings for fashion, tailoring, and manufacturing use, with a broad range covering functional and decorative styles. Stock is geared toward designers, tailors, and producers sourcing components for garment construction, repairs, or small-scale production.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
},
{
  "name": "Nova Kaeru - Leather",
  "id": "Nova_Kaeru",
  "address": "Trs Rios, Rio de Janeiro, Brazil",
  "category": "Online",
  "phone": null,
  "website": null,
  "opening_hours": null,
  "pop_up": "Nova Kaeru Exotic Leather supplies sustainable exotic and bio-leathers, including fish-based leather, from its facility in Brazil.",
  "lng": null,
  "tags": [
    "Leather",
    "Fish leather",
    "Exotic leather",
    "Pirarucu leather",
    "Organic tanning",
    "Sustainable materials",
    "Bioleather",
    "Fashion materials",
    "Accessory materials",
    "Production stock",
    "Brazil based",
    "Online shop"
  ],
  "more_info": "Nova Kaeru Exotic Leather is a leather supplier based in Estrada de So Joaquim, Bemposta, Trs Rios, Rio de Janeiro, Brazil. The company specialises in sustainable and organic leather production, with a focus on exotic materials such as pirarucu fish leather and other bio-tanned hides. Nova Kaeru sources and processes leather using organic tanning methods that avoid harmful heavy metals, and works with local cooperatives in the Amazon region on sustainable raw material practices. Its range of materials is suitable for fashion, accessories, and design applications, reflecting a combination of traditional techniques and technological processes.",
  "average_price": null,
  "been": "NO",
  "approved": "NO",
  "overall": null
}



]